emacs-config.org
#+TITLE: Emacs configuration

#+DESCRIPTION: emacs configuration
#+STARTUP: showall

#+OPTIONS: toc:nil
#+OPTIONS: ^:nil

#+EXPORT_FILE_NAME: README.md

# don't export trees tagged with:
#+EXCLUDE_TAGS: tasklist noexport broken
# enable exporting TODO and DONE only (as well as non tasks)
#+OPTIONS: tasks:("TODO" "DONE") 
# do not include task keywords or tags in export
#+OPTIONS: todo:nil tags:nil

#+PROPERTY: header-args    :results silent
#+PROPERTY: header-args:bash :tangle-mode (identity #o555)
#+PROPERTY: header-args:conf :tangle-mode (identity #o444)
#+PROPERTY: header-args:emacs-lisp :tangle-mode (identity #o444)
#+PROPERTY: header-args:gpg :cache no :tangle-mode (identity #o600)

#+FILETAGS: :emacs:programming:

* Introduction                                                     
:LOGBOOK:
- State "TODO"       from              [2025-01-20 Mon 23:48]
:END:

Emacs customisation generates [[file:init.el::defvar bootstrap-version][init.el]] and other [[file:etc/elisp/][emacs elisp utility
files]]  using [[https://orgmode.org/manual/Extracting-Source-Code.html][org-babel-tangle]]. 

** Own libraries

These libraries are seperate stand alone github libraries. 

*** el-docstring-sap

Provides docstring help for symbol at point.

[[https://github.com/rileyrg/el-docstring-sap][https://github.com/rileyrg/el-docstring-sap]]


*** lazy-lang-learn

A small "game" like utility that displays snippets to glance at. You
can then invoke google translate on them. Stores history.

[[https://github.com/rileyrg/lazy-lang-learn]]


* early-init
:PROPERTIES:
:header-args:emacs-lisp: :tangle (expand-file-name "early-init.el" user-emacs-directory)
:END:
Emacs early-init
https://www.gnu.org/software/emacs/manual/html_node/emacs/Early-Init-File.html

** redirect emacs cache
#+begin_src emacs-lisp
  ;;; early-init.el --- early bird  -*- no-byte-compile: t -*-
  ;; Maintained in emacs-config.org
  (when (boundp 'native-comp-eln-load-path)
    (startup-redirect-eln-cache "var/eln-cache"))
  (setq max-specpdl-size 13000)
#+end_src

** elpaca
#+begin_src  emacs-lisp
(setq package-enable-at-startup nil)
#+end_src

** elisp locations
#+begin_src  emacs-lisp
  (defcustom rgr/elisp-dir (expand-file-name "etc/elisp" user-emacs-directory)
    "Where user elisp files should be stored."
    :type 'directory
    :group 'rgr)

  (defun rgr/user-elisp-file (f)
    "Return the full path to a user Emacs Lisp file F."
    (expand-file-name f rgr/elisp-dir))

  ;; Ensure the directory exists before adding it to load-path
  (make-directory rgr/elisp-dir t)

  ;; Add the directory to the load-path, preferring to the front and avoiding duplicates.
  (add-to-list 'load-path rgr/elisp-dir)

#+end_src 

* emacs main init
:PROPERTIES:
:header-args:emacs-lisp: :tangle (expand-file-name "init.el" user-emacs-directory)
:END:
** debug init
#+begin_src  emacs-lisp
    ;; look for a debug init file and load, trigger the debugger
  (defun debug-init (&optional fname)
    (let* ((fname (if fname fname "debug-init.el"))
           (debug-init (expand-file-name fname user-emacs-directory)))
      (if (file-exists-p debug-init)
          (progn
            (message "A debug-init, %s, was found, so loading." debug-init)
            (let ((rgr/debug-init-debugger t)) ;; can set rgr/debug-init-debugger to false in the debug init to avoid triggering the debugger
              (load-file debug-init)
              (if rgr/debug-init-debugger
                  (debug)
                (message " After loading %s `rgr/debug-init-debugger was set to nil so not debugging." debug-init))))
        (message "No debug initfile, %s, found so ignoring" debug-init))))
  (debug-init)
#+end_src

** package management
*** own projects
#+begin_src  emacs-lisp
    (defcustom rgr/emacs-project-dir "~/development/emacs" "personal elisp libraries" )
#+end_src
*** elpaca
#+begin_src  emacs-lisp
  (defvar elpaca-installer-version 0.11)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
#+end_src

*** elpaca use-package support
#+begin_src  emacs-lisp
  (elpaca elpaca-use-package
    ;; Enable use-package :ensure support for Elpaca.
    (elpaca-use-package-mode))
#+end_src 
** custom.el
#+begin_src emacs-lisp
  (setq custom-file  (expand-file-name  "var/secrets/custom.el" user-emacs-directory))
  (load custom-file 'noerror)
#+end_src
** no-littering - keep data tidy
#+begin_src  emacs-lisp
  ;; put extra emacs-lisp files into etc/elisp
  (let ((default-directory rgr/elisp-dir))
    (normal-top-level-add-subdirs-to-load-path))

  (use-package no-littering
    :custom
    (make-backup-files t)
    :config
    (setq backup-directory-alist
          `(("." . ,(no-littering-expand-var-file-name "backup/"))))
    (setq auto-save-file-name-transforms
          `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))
#+end_src
** notifications
#+begin_src  emacs-lisp
  (require 'notifications)
  (defun emacs-alert(m &optional rest)
    (notifications-notify
     :title "Emacs"
     :body (format m rest)))
#+end_src

** quit emacs
#+begin_src  emacs-lisp

  (defun rgr/quit-or-close-emacs(&optional kill)
    (interactive)
    (if (or current-prefix-arg kill)
        (rgr/server-shutdown)
      (delete-frame)))

  (defun rgr/server-shutdown ()
    "Save buffers, Quit, and Shutdown (kill) server"
    (interactive)
    (save-buffers-kill-emacs))

  (global-set-key (kbd "C-c x")  'rgr/quit-or-close-emacs)

#+end_src 
