README.md


# Introduction

Emacs customisation generates [init.el](init.el) and other [emacs elisp utility
files](etc/elisp/)  using [org-babel-tangle](https://orgmode.org/manual/Extracting-Source-Code.html). 


## Own libraries

These libraries are seperate stand alone github libraries. 


### el-docstring-sap

Provides docstring help for symbol at point.

[https://github.com/rileyrg/el-docstring-sap](https://github.com/rileyrg/el-docstring-sap)


### lazy-lang-learn

A small "game" like utility that displays snippets to glance at. You
can then invoke google translate on them. Stores history.

<https://github.com/rileyrg/lazy-lang-learn>


# early-init

Emacs early-init
<https://www.gnu.org/software/emacs/manual/html_node/emacs/Early-Init-File.html>


## redirect emacs cache

    ;;; early-init.el --- early bird  -*- no-byte-compile: t -*-
    ;; Maintained in emacs-config.org
    (when (boundp 'native-comp-eln-load-path)
      (startup-redirect-eln-cache "var/eln-cache"))
    (setq max-specpdl-size 13000)


## elpaca

    (setq package-enable-at-startup nil)


## elisp locations

    (defcustom rgr/elisp-dir (expand-file-name  "etc/elisp" user-emacs-directory) "Where user elisp files should be stored")
    (defun rgr/user-elisp-file(f)
      (expand-file-name f rgr/elisp-dir))
    (setq load-path (cons rgr/elisp-dir load-path))


# emacs main init


## debug init

      ;; look for a debug init file and load, trigger the debugger
    (defun debug-init (&optional fname)
      (let* ((fname (if fname fname "debug-init.el"))
             (debug-init (expand-file-name fname user-emacs-directory)))
        (if (file-exists-p debug-init)
            (progn
              (message "A debug-init, %s, was found, so loading." debug-init)
              (let ((rgr/debug-init-debugger t)) ;; can set rgr/debug-init-debugger to false in the debug init to avoid triggering the debugger
                (load-file debug-init)
                (if rgr/debug-init-debugger
                    (debug)
                  (message " After loading %s `rgr/debug-init-debugger was set to nil so not debugging." debug-init))))
          (message "No debug initfile, %s, found so ignoring" debug-init))))
    (debug-init)


## package management


### own projects

    (defcustom rgr/emacs-project-dir "~/development/emacs" "personal elisp libraries" )


### elpaca

    (defvar elpaca-installer-version 0.10)
    (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
    (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
    (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
    (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                  :ref nil :depth 1 :inherit ignore
                                  :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                  :build (:not elpaca--activate-package)))
    (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
           (build (expand-file-name "elpaca/" elpaca-builds-directory))
           (order (cdr elpaca-order))
           (default-directory repo))
      (add-to-list 'load-path (if (file-exists-p build) build repo))
      (unless (file-exists-p repo)
        (make-directory repo t)
        (when (<= emacs-major-version 28) (require 'subr-x))
        (condition-case-unless-debug err
            (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                      ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                      ,@(when-let* ((depth (plist-get order :depth)))
                                                          (list (format "--depth=%d" depth) "--no-single-branch"))
                                                      ,(plist-get order :repo) ,repo))))
                      ((zerop (call-process "git" nil buffer t "checkout"
                                            (or (plist-get order :ref) "--"))))
                      (emacs (concat invocation-directory invocation-name))
                      ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                            "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                      ((require 'elpaca))
                      ((elpaca-generate-autoloads "elpaca" repo)))
                (progn (message "%s" (buffer-string)) (kill-buffer buffer))
              (error "%s" (with-current-buffer buffer (buffer-string))))
          ((error) (warn "%s" err) (delete-directory repo 'recursive))))
      (unless (require 'elpaca-autoloads nil t)
        (require 'elpaca)
        (elpaca-generate-autoloads "elpaca" repo)
        (load "./elpaca-autoloads")))
    (add-hook 'after-init-hook #'elpaca-process-queues)
    (elpaca `(,@elpaca-order))


### elpaca use-package support

    (elpaca elpaca-use-package
      ;; Enable use-package :ensure support for Elpaca.
      (elpaca-use-package-mode))


## custom.el

    (setq custom-file  (expand-file-name  "var/secrets/custom.el" user-emacs-directory))
    (load custom-file 'noerror)


## no-littering - keep data tidy

    ;; put extra emacs-lisp files into etc/elisp
    (let ((default-directory rgr/elisp-dir))
      (normal-top-level-add-subdirs-to-load-path))
    
    (use-package no-littering
      :custom
      (make-backup-files t)
      :config
      (setq backup-directory-alist
            `(("." . ,(no-littering-expand-var-file-name "backup/"))))
      (setq auto-save-file-name-transforms
            `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))


## notifications

    (require 'notifications)
    (defun emacs-alert(m &optional rest)
      (notifications-notify
       :title "Emacs"
       :body (format m rest)))


## quit emacs

    
    (defun rgr/quit-or-close-emacs(&optional kill)
      (interactive)
      (if (or current-prefix-arg kill)
          (rgr/server-shutdown)
        (delete-frame)))
    
    (defun rgr/server-shutdown ()
      "Save buffers, Quit, and Shutdown (kill) server"
      (interactive)
      (save-buffers-kill-emacs))
    
    (global-set-key (kbd "C-c x")  'rgr/quit-or-close-emacs)
