emacs-config.org
** load  inits 
#+begin_src  emacs-lisp

  (setq rgr/daemonName (daemonp))
  ;; we dont always want a session to use/update history
  (setq rgr/session-history t)

  ;; we always load general init unless daemon name begins with "_" , but if its not the command line choice or a non daemon, dont keep history etc.
  (if (and rgr/daemonName (string-match-p "^_.*$" rgr/daemonName))
      (setq rgr/daemonName (substring rgr/daemonName 1))
    (load-file (rgr/user-elisp-file "init-general.el"))
    )

  ;; now load daemon specific init file
  (if (and rgr/daemonName (not (string= rgr/daemonName "general")))
      (let((f (rgr/user-elisp-file (format "init-%s.el" rgr/daemonName))))
        (when (file-exists-p f)
          ;; default to turning off history : the init can override it
          (setq rgr/session-history nil)
          (emacs-alert (format "loading daemon init file : %s" f))
          (load-file  f))))

  (if rgr/session-history
      (progn 
        (recentf-mode)
        (save-place-mode)
        (savehist-mode)))

  (setq rgr/fileRestored nil)
  (defun rgr/after-display()
    (if rgr/session-history
        (set-face-background 'mode-line "lightgreen")
      (set-face-background 'mode-line "orangered"))
    (when rgr/daemonName
      (set-frame-name (format "Emacs-%s" rgr/daemonName)))
    ;; (when (get-buffer "*elpaca-log*")
    ;;   (kill-buffer "*elpaca-log*"))
    (when (and rgr/session-history (not rgr/fileRestored))
      (setq rgr/fileRestored t)
      (run-with-idle-timer 0.3 nil (lambda()(switch-to-buffer (recentf-open-most-recent-file 1))))
      ))

  (if rgr/daemonName
      (add-hook 'server-after-make-frame-hook #'rgr/after-display)
    (add-hook 'elpaca-after-init-hook 'rgr/after-display))

#+end_src


* general init
:PROPERTIES:
:header-args:emacs-lisp: :tangle (rgr/user-elisp-file "init-general.el")
:END:

** startup
#+begin_src emacs-lisp
  (emacs-alert " ... is starting up..." )
#+end_src

** Load early stuff / gpg
:PROPERTIES:
:ID:       4695d758-01da-4669-9941-d4d56e9aa2bf
:END:
Load all files in certain directories.
#+begin_src emacs-lisp
  (defun load-el-gpg (load-dir)
    (message "attempting mass load from %s." load-dir)
    (when (file-exists-p load-dir)
      (dolist (f (directory-files-recursively load-dir "\.[el|gpg]$"))
        (condition-case nil
            (progn
              (message "load-el-gpg loading %s" f)
              (load f 'no-error))
          (error nil)))))
  (load-el-gpg (expand-file-name "etc/early-load" user-emacs-directory))
#+end_src
*** host specific

:PROPERTIES:
:ID:       efe9afb5-3779-407d-a7a9-fd8968ea0f69
:END:

Stick a custom in here. eg my thinkpad [[./etc/hosts/thinkpadx270/custom.el][custom file]].

#+begin_src emacs-lisp
  (load-el-gpg (expand-file-name (system-name)  (expand-file-name "etc/hosts" user-emacs-directory)))
#+end_src

** Security

*** Auth-Sources, get-auth-info
:PROPERTIES:
:ID:       8f8f4b02-bdd2-4ad9-81bb-c3dd14b2fe9d
:END:
Let emacs take care of security things automagically.
example:
#+begin_src emacs-lisp :tangle no
  (setq passw (get-auth-info "licenses" "my-auth-token"))
#+end_src
#+begin_src emacs-lisp
  (require 'auth-source)
  (defun get-auth-info (host user &optional port)
    "Interface to `auth-source-search' to fetch a secret for the HOST and USER."
    (let* ((info (nth 0 (auth-source-search
                         :host host
                         :user user
                         :port port
                         :require '(:user :secret)
                         :create nil)))
           (secret (plist-get info :secret)))
      (if (functionp secret)
          (funcall secret)
        secret)))
#+end_src

*** Pass
Uses the unix command line ~pass~ utility. Can be used via ~process-lines~  e.g
#+begin_src emacs-lisp :tangle yes
  ;;(car (process-lines "pass" "Chat/slack-api-token"))
#+end_src

** themes
*** modus themes
:PROPERTIES:
:ID:       fa3ac5bf-2fbe-4e67-9032-0cb23a84c434
:END:
https://github.com/protesilaos/modus-themes
#+begin_src emacs-lisp
  (use-package modus-themes
    :config
    (load-theme 'modus-operandi :no-confirm))
#+end_src
** Org functionality
:PROPERTIES:
:ID:       98f4dbe1-6f34-4246-8ee6-96e8ab24d1b1
:END:
General org-mode config

*** Org Mode, org-mode                                                  :org: 
:PROPERTIES:
:ID:       80d295c4-fe60-4bef-99e2-2f15bcb1e36a
:END:
#+begin_src emacs-lisp
  ;;(push (expand-file-name "builds/org" elpaca-directory) load-path)
  (use-package org
    :custom
    ;;    (org-agenda-files (append (directory-files-recursively "~/.emacs.d/var/org/orgfiles" "^[[:alnum:]].*\\.org\\'") (directory-files-recursively "~/development/projects" "^[[:alnum:]].*\\.org\\'")))
    (org-fontify-done-headline t)
    (org-fontify-todo-headline t)
    (org-clock-idle-time 10)
    (org-babel-default-header-args:python
     '((:results  . "output")))
    (org-export-with-broken-links t)
    (org-refile-use-outline-path 'file)
    (org-outline-path-complete-in-steps nil)
    :config
    (set-face-attribute 'org-headline-done nil :strike-through t)
    (defun rgr/org-agenda (&optional arg)
      (interactive "P")
      (let ((org-agenda-tag-filter-preset '("-trash")))
        (org-agenda arg "a")))
    (require 'org-crypt)
    (org-crypt-use-before-save-magic)
    :hook
    (org-mode .  turn-on-auto-fill)
    :bind
    ("C-c a" . org-agenda)
    ("C-c A" . rgr/org-agenda)
    ("C-c c" . org-capture)
    ("C-c l" . org-store-link)
    ("C-c C-l" . org-insert-link)
    ("C-c C-s" . org-schedule)
    ("C-c C-t" . org-todo)
    ("C-c C-x C-j" . org-clock-goto)
    (:map org-mode-map
          ("M-." . find-function-at-point)))
#+end_src


*** org agenda files
:PROPERTIES:
:ID:       1a27d0a1-8b17-4b86-84f7-aa7f0c006005
:header-args:conf: :tangle no
:END:
See ~org-agenda-files~ [[id:80d295c4-fe60-4bef-99e2-2f15bcb1e36a][org-agenda-files]]
maintain a file pointing to agenda sources : NOTE, NOT tangled. ((no-littering-expand-etc-file-name "org/agenda-files.txt"))
#+begin_src conf
  ~/.emacs.d/var/org/orgfiles
  ~/.emacs.d/var/org/orgfiles/journals
  ~/.emacs.d/var/org/orgfiles/projects
  ~/development/education/lessons
  ~/development/education/lessons/bash
  ~/development/education/lessons/python
  ~/development/education/lessons/python/coreyschafer
  ~/development/education/lessons/python/python-lernen.de
  ~/development/education/lessons/elisp
#+end_src
** Project Management                                               :project:
*** use emacs project package
#+begin_src  emacs-lisp
  (use-package project
    :ensure t
    :after (org)
    :custom
    (project-vc-extra-root-markers '(".project"))
    :config
    (define-key project-prefix-map "v" '("vterm" .  multi-vterm-project))
    (define-key project-prefix-map "V" '("terminal" .  (lambda()(interactive)(shell-command "kitty"))))
    (define-key project-prefix-map "u" '("project url" .  rgr/project-url)))

  ;; (require 'project)
  ;; (define-key project-prefix-map "v" '("vterm" .  multi-vterm-project))
  ;; (define-key project-prefix-map "u" '("project url" .  rgr/project-url))

#+end_src
*** add project based TODO
#+begin_src  emacs-lisp
  (setq load-path (cons (expand-file-name "project-org-todo-capture" rgr/emacs-project-dir ) load-path))
  (use-package project-org-todo-capture
    :after org
    :ensure nil
    :init
    (require 'org-capture)
    :bind (:map project-prefix-map
                (("t" . project-org-todo-capture)
                ("T" . project-org-todo-capture-file-open))))
#+end_src 

** toggle buffer
:PROPERTIES:
:ID:       cf781280-b126-402f-9700-c061a385bf81
:END:
#+begin_src emacs-lisp
  (defun rgr/toggle-buffer(n)
    "jump to or from buffer named n else default to *Messages*"
    (interactive "bbuffer:")
    (let ((n (or n
                 "*Messages*")))
      (switch-to-buffer (if (string= (buffer-name) n)
                            (other-buffer) n))))
#+end_src
** read and write elisp vars to file
:PROPERTIES:
:ID:       82905a95-6e37-4114-ba77-4be0dd31a9ec
:END:
#+begin_src emacs-lisp

  (defun rgr/elisp-write-var (f v)
    (with-temp-file f
      (prin1 v (current-buffer))))

  (defun rgr/elisp-read-var (f)
    (with-temp-buffer
      (insert-file-contents f)
      (cl-assert (eq (point) (point-min)))
      (read (current-buffer))))
#+end_src

