README.md


## load  inits

    
    (setq rgr/daemonName (daemonp))
    ;; we dont always want a session to use/update history
    (setq rgr/session-history t)
    
    ;; we always load general init unless daemon name begins with "_" , but if its not the command line choice or a non daemon, dont keep history etc.
    (if (and rgr/daemonName (string-match-p "^_.*$" rgr/daemonName))
        (setq rgr/daemonName (substring rgr/daemonName 1))
      (load-file (rgr/user-elisp-file "init-general.el"))
      )
    
    ;; now load daemon specific init file
    (if (and rgr/daemonName (not (string= rgr/daemonName "general")))
        (let((f (rgr/user-elisp-file (format "init-%s.el" rgr/daemonName))))
          (when (file-exists-p f)
            ;; default to turning off history : the init can override it
            (setq rgr/session-history nil)
            (emacs-alert (format "loading daemon init file : %s" f))
            (load-file  f))))
    
    (if rgr/session-history
        (progn 
          (recentf-mode)
          (save-place-mode)
          (savehist-mode)))
    
    (setq rgr/fileRestored nil)
    (defun rgr/after-display()
      (if rgr/session-history
          (set-face-background 'mode-line "lightgreen")
        (set-face-background 'mode-line "orangered"))
      (when rgr/daemonName
        (set-frame-name (format "Emacs-%s" rgr/daemonName)))
      ;; (when (get-buffer "*elpaca-log*")
      ;;   (kill-buffer "*elpaca-log*"))
      (when (and rgr/session-history (not rgr/fileRestored))
        (setq rgr/fileRestored t)
        (run-with-idle-timer 0.3 nil (lambda()(switch-to-buffer (recentf-open-most-recent-file 1))))
        ))
    
    (if rgr/daemonName
        (add-hook 'server-after-make-frame-hook #'rgr/after-display)
      (add-hook 'elpaca-after-init-hook 'rgr/after-display))


# general init


## startup

    (emacs-alert " ... is starting up..." )


## Load early stuff / gpg

Load all files in certain directories.

    (defun load-el-gpg (load-dir)
      (message "attempting mass load from %s." load-dir)
      (when (file-exists-p load-dir)
        (dolist (f (directory-files-recursively load-dir "\.[el|gpg]$"))
          (condition-case nil
              (progn
                (message "load-el-gpg loading %s" f)
                (load f 'no-error))
            (error nil)))))
    (load-el-gpg (expand-file-name "etc/early-load" user-emacs-directory))


### host specific

:ID:       efe9afb5-3779-407d-a7a9-fd8968ea0f69

Stick a custom in here. eg my thinkpad [custom file](./etc/hosts/thinkpadx270/custom.el).

    (load-el-gpg (expand-file-name (system-name)  (expand-file-name "etc/hosts" user-emacs-directory)))


## Security


### Auth-Sources, get-auth-info

Let emacs take care of security things automagically.
example:

    (setq passw (get-auth-info "licenses" "my-auth-token"))

    (require 'auth-source)
    (defun get-auth-info (host user &optional port)
      "Interface to `auth-source-search' to fetch a secret for the HOST and USER."
      (let* ((info (nth 0 (auth-source-search
                           :host host
                           :user user
                           :port port
                           :require '(:user :secret)
                           :create nil)))
             (secret (plist-get info :secret)))
        (if (functionp secret)
            (funcall secret)
          secret)))


### Pass

Uses the unix command line `pass` utility. Can be used via `process-lines`  e.g

    ;;(car (process-lines "pass" "Chat/slack-api-token"))


## themes


### modus themes

<https://github.com/protesilaos/modus-themes>

    (use-package modus-themes
      :config
      (load-theme 'modus-operandi :no-confirm))


## Org functionality

General org-mode config


<a id="orge8a8ed3"></a>

### Org Mode, org-mode

    ;;(push (expand-file-name "builds/org" elpaca-directory) load-path)
    (use-package org
      :custom
      ;;    (org-agenda-files (append (directory-files-recursively "~/.emacs.d/var/org/orgfiles" "^[[:alnum:]].*\\.org\\'") (directory-files-recursively "~/development/projects" "^[[:alnum:]].*\\.org\\'")))
      (org-fontify-done-headline t)
      (org-fontify-todo-headline t)
      (org-clock-idle-time 10)
      (org-babel-default-header-args:python
       '((:results  . "output")))
      (org-export-with-broken-links t)
      (org-refile-use-outline-path 'file)
      (org-outline-path-complete-in-steps nil)
      :config
      (set-face-attribute 'org-headline-done nil :strike-through t)
      (defun rgr/org-agenda (&optional arg)
        (interactive "P")
        (let ((org-agenda-tag-filter-preset '("-trash")))
          (org-agenda arg "a")))
      (require 'org-crypt)
      (org-crypt-use-before-save-magic)
      :hook
      (org-mode .  turn-on-auto-fill)
      :bind
      ("C-c a" . org-agenda)
      ("C-c A" . rgr/org-agenda)
      ("C-c c" . org-capture)
      ("C-c l" . org-store-link)
      ("C-c C-l" . org-insert-link)
      ("C-c C-s" . org-schedule)
      ("C-c C-t" . org-todo)
      ("C-c C-x C-j" . org-clock-goto)
      (:map org-mode-map
            ("M-." . find-function-at-point)))


### org agenda files

See `org-agenda-files` [org-agenda-files](#orge8a8ed3)
maintain a file pointing to agenda sources : NOTE, NOT tangled. ((no-littering-expand-etc-file-name "org/agenda-files.txt"))

    ~/.emacs.d/var/org/orgfiles
    ~/.emacs.d/var/org/orgfiles/journals
    ~/.emacs.d/var/org/orgfiles/projects
    ~/development/education/lessons
    ~/development/education/lessons/bash
    ~/development/education/lessons/python
    ~/development/education/lessons/python/coreyschafer
    ~/development/education/lessons/python/python-lernen.de
    ~/development/education/lessons/elisp


## Project Management


### use emacs project package

    (use-package project
      :ensure t
      :after (org)
      :custom
      (project-vc-extra-root-markers '(".project"))
      :config
      (define-key project-prefix-map "v" '("vterm" .  multi-vterm-project))
      (define-key project-prefix-map "u" '("project url" .  rgr/project-url)))


### add project based TODO

    (setq load-path (cons (expand-file-name "project-org-todo-capture" rgr/emacs-project-dir ) load-path))
    (use-package project-org-todo-capture
      :after org
      :ensure nil
      :init
      (require 'org-capture)
      :bind (:map project-prefix-map
                  (("t" . project-org-todo-capture)
                  ("T" . project-org-todo-capture-file-open))))


## toggle buffer

    (defun rgr/toggle-buffer(n)
      "jump to or from buffer named n else default to *Messages*"
      (interactive "bbuffer:")
      (let ((n (or n
                   "*Messages*")))
        (switch-to-buffer (if (string= (buffer-name) n)
                              (other-buffer) n))))


## read and write elisp vars to file

    
    (defun rgr/elisp-write-var (f v)
      (with-temp-file f
        (prin1 v (current-buffer))))
    
    (defun rgr/elisp-read-var (f)
      (with-temp-buffer
        (insert-file-contents f)
        (cl-assert (eq (point) (point-min)))
        (read (current-buffer))))
