emacs-config.org
** completing lines
#+begin_src  emacs-lisp
  (defvar rgr/complete-line-f 'rgr/newline-below "The fname called by `rgr/complete-line'")

  (defun rgr/complete-line()
    (interactive)
    (funcall rgr/complete-line-f))

  (defun rgr/c-complete-line()
    (end-of-line)
    (delete-trailing-whitespace)
    (unless (eql ?\; (char-before (point-at-eol)))
      (insert ";"))
    (newline-and-indent))

  (defun rgr/insert-previous-line()
    (previous-line)
    (end-of-line)
    (newline-and-indent)
    (insert (string-trim (current-kill 0))))

  (defun rgr/newline-below()
    (end-of-line)
    (newline-and-indent))


  (global-set-key (kbd "C-S-<return>")  'rgr/complete-line)

#+end_src

** Lazy Language Learning, lazy-lang-learn
My own hack for popping up text to learn
:PROPERTIES:
:END:
#+begin_src emacs-lisp
  (setq load-path (cons (expand-file-name "lazy-lang-learn" rgr/emacs-project-dir ) load-path))
  (use-package lazy-lang-learn
    :ensure  nil
    :bind
    ("C-c L" . lazy-lang-learn-mode)
    ("<f12>" . lazy-lang-learn-translate)
    ("S-<f12>" . lazy-lang-learn-translate-from-history))
#+end_src

** Minibuffer Enrichment (search, sudo edit...)                  :minibuffer:
:PROPERTIES:
:ID:       ccdf6738-f921-4d2f-81ea-6dd00883867c
:END:
Various plugins for minibuffer enrichment

*** [[https://github.com/nflath/sudo-edit][sudo-edit]] Priviliged file editing
:PROPERTIES:
:ID:       cfdbc3a9-af09-4608-86bb-de6b3d2f2b3a
:END:
#+begin_src emacs-lisp
  (use-package sudo-edit)
#+end_src
*** find file at point
:PROPERTIES:
:ID:       bd247b04-92dc-4db6-911e-df716bd8574a
:END:

#+begin_src emacs-lisp
  (use-package ffap
    :ensure nil
    :custom
    (ffap-require-prefix nil)
    :init
    (ffap-bindings)
    (defun rgr/ffap()
      (interactive)
      (let ((url (ffap-url-at-point)))
        (if (and url current-prefix-arg)
            (progn
              (notifications-notify
               :title "Emacs"
               :body "opening url in generic browser")
              (browse-url-generic url))
          (call-interactively 'find-file-at-point))))
    :bind
    ( "C-x C-f" . rgr/ffap))
#+end_src
*** eldoc

#+begin_src  emacs-lisp
  (unload-feature 'eldoc t)
  (setq custom-delayed-init-variables '())
  (elpaca eldoc
    (require 'eldoc)
    (global-eldoc-mode)
    (defun rgr/eldoc-at-point()
      (interactive)
      (if eldoc-mode
          (eldoc-box-help-at-point)
        (message "eldoc not active")))
    (global-set-key (kbd "C-.")  'rgr/eldoc-at-point))
  (use-package eldoc-box
    :after eldoc)
#+end_src
*** Consult
