README.md


## completing lines

    (defvar rgr/complete-line-f 'rgr/newline-below "The fname called by `rgr/complete-line'")
    
    (defun rgr/complete-line()
      (interactive)
      (funcall rgr/complete-line-f))
    
    (defun rgr/c-complete-line()
      (end-of-line)
      (delete-trailing-whitespace)
      (unless (eql ?\; (char-before (point-at-eol)))
        (insert ";"))
      (newline-and-indent))
    
    (defun rgr/insert-previous-line()
      (previous-line)
      (end-of-line)
      (newline-and-indent)
      (insert (string-trim (current-kill 0))))
    
    (defun rgr/newline-below()
      (end-of-line)
      (newline-and-indent))
    
    
    (global-set-key (kbd "C-S-<return>")  'rgr/complete-line)


## Lazy Language Learning, lazy-lang-learn

My own hack for popping up text to learn

    (setq load-path (cons (expand-file-name "lazy-lang-learn" rgr/emacs-project-dir ) load-path))
    (use-package lazy-lang-learn
      :ensure  nil
      :bind
      ("C-c L" . lazy-lang-learn-mode)
      ("<f12>" . lazy-lang-learn-translate)
      ("S-<f12>" . lazy-lang-learn-translate-from-history))


## Minibuffer Enrichment (search, sudo edit&#x2026;)

Various plugins for minibuffer enrichment


### [sudo-edit](https://github.com/nflath/sudo-edit) Priviliged file editing

    (use-package sudo-edit)


### find file at point

    (use-package ffap
      :ensure nil
      :custom
      (ffap-require-prefix nil)
      :init
      (ffap-bindings)
      (defun rgr/ffap()
        (interactive)
        (let ((url (ffap-url-at-point)))
          (if (and url current-prefix-arg)
              (progn
                (notifications-notify
                 :title "Emacs"
                 :body "opening url in generic browser")
                (browse-url-generic url))
            (call-interactively 'find-file-at-point))))
      :bind
      ( "C-x C-f" . rgr/ffap))


### eldoc

    (unload-feature 'eldoc t)
    (setq custom-delayed-init-variables '())
    (elpaca eldoc
      (require 'eldoc)
      (global-eldoc-mode)
      (defun rgr/eldoc-at-point()
        (interactive)
        (if eldoc-mode
            (eldoc-box-help-at-point)
          (message "eldoc not active")))
      (global-set-key (kbd "C-.")  'rgr/eldoc-at-point))
    (use-package eldoc-box
      :after eldoc)
