emacs-config.org
*** embark
#+begin_src  emacs-lisp
  (use-package embark
    :ensure t

    :bind
    (("C-," . embark-act)         ;; pick some comfortable binding
     ("C-:" . embark-act-all)
     ("C-;" . embark-dwim)        ;; good alternative: M-.
     ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

    :init

    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command)

    ;; Show the Embark target at point via Eldoc. You may adjust the
    ;; Eldoc strategy, if you want to see the documentation from
    ;; multiple providers. Beware that using this can be a little
    ;; jarring since the message shown in the minibuffer can be more
    ;; than one line, causing the modeline to move up and down:

    ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
    ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

    :config

    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))

  ;; Consult users will also want the embark-consult package.
  (use-package embark-consult
    :demand t ; only need to install it, embark loads it after consult if found
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))

#+end_src 
*** all-the-icons
Remember to run *all-the-icons-install-fonts*.
#+begin_src  emacs-lisp
  (use-package all-the-icons
    :demand
    :after (marginalia)
    :config
    (use-package all-the-icons-completion
      :init (all-the-icons-completion-mode))
    (use-package all-the-icons-dired
      :config
      (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))
    :hook (marginalia-mode . all-the-icons-completion-marginalia-setup))

#+end_src

** Completion                                                    :completion:
:PROPERTIES:
:END:
Let emacs suggest completions

*** corfu

#+begin_src emacs-lisp
  (use-package corfu
    ;;:disabled t
    ;; Optional customizations
    :custom
    ;; (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
    (corfu-auto t)                 ;; Enable auto completion
    ;;(corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
    (corfu-quit-no-match t)      ;; Never quit, even if there is no match
    (corfu-popupinfo-delay (cons nil 1.0))
    (corfu-preview-current t)    ;; Disable current candidate preview
    ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
    ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches

    ;; Enable Corfu only for certain modes. See also `global-corfu-modes'.
    ;; :hook ((prog-mode . corfu-mode)
    ;;        (shell-mode . corfu-mode)
    ;;        (eshell-mode . corfu-mode))

    ;; Recommended: Enable Corfu globally.  This is recommended since Dabbrev can
    ;; be used globally (M-/).  See also the customization variable
    ;; `global-corfu-modes' to exclude certain modes.
    ;; A few more useful configurations...
    ;;TAB cycle if there are only few candidates
    ;; (completion-cycle-threshold 3)

    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    (tab-always-indent 'complete)

    ;; Emacs 30 and newer: Disable Ispell completion function.
    ;; Try `cape-dict' as an alternative.
    (text-mode-ispell-word-completion nil)

    ;; Hide commands in M-x which do not apply to the current mode.  Corfu
    ;; commands are hidden, since they are not used via M-x. This setting is
    ;; useful beyond Corfu.
    (read-extended-command-predicate #'command-completion-default-include-p)
  :init
  (global-corfu-mode)
  (corfu-popupinfo-mode))

  ;; Optionally use the `orderless' completion style.
  (use-package orderless
    :custom
    ;; (orderless-style-dispatchers '(orderless-affix-dispatch))
    ;; (orderless-component-separator #'orderless-escapable-split-on-space)
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles partial-completion)))))


  ;; Use Dabbrev with Corfu!
  (use-package dabbrev
    :ensure nil
    ;; Swap M-/ and C-M-/
    :bind (("M-/" . dabbrev-completion)
           ("C-M-/" . dabbrev-expand))
    :config
    (add-to-list 'dabbrev-ignored-buffer-regexps "\\` ")
    ;; Since 29.1, use `dabbrev-ignored-buffer-regexps' on older.
    (add-to-list 'dabbrev-ignored-buffer-modes 'doc-view-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'pdf-view-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'tags-table-mode))

  ;; Add extensions
  (use-package cape
    ;; Bind prefix keymap providing all Cape commands under a mnemonic key.
    ;; Press C-c p ? to for help.
    :bind ("C-c p" . cape-prefix-map) ;; Alternative keys: M-p, M-+, ...
    ;; Alternatively bind Cape commands individually.
    ;; :bind (("C-c p d" . cape-dabbrev)
    ;;        ("C-c p h" . cape-history)
    ;;        ("C-c p f" . cape-file)
    ;;        ...)
    :init
    ;; Add to the global default value of `completion-at-point-functions' which is
    ;; used by `completion-at-point'.  The order of the functions matters, the
    ;; first function returning a result wins.  Note that the list of buffer-local
    ;; completion functions takes precedence over the global list.
    (add-hook 'completion-at-point-functions #'cape-dabbrev)
    (add-hook 'completion-at-point-functions #'cape-file)
    (add-hook 'completion-at-point-functions #'cape-elisp-block)
    ;; (add-hook 'completion-at-point-functions #'cape-history)
    ;; ...
    )
#+end_src


*** Which Key                                                     :which:key:
:PROPERTIES:
:END:
[[https://github.com/justbur/emacs-which-key][which-key]] shows you what further key options you have if you pause on a multi key command.
#+begin_src emacs-lisp
  (use-package  which-key
    :ensure nil
    :demand t
    :config (which-key-mode))
#+end_src
*** Yasnippet                                                     :yasnippet:
[[https://github.com/joaotavora/yasnippet][YASnippet]]  is a template system for Emacs.
Note that eglot 1.4 auto enables snippets so no need to yas-minor or global mode
#+begin_src emacs-lisp
    (use-package yasnippet
      :config
      (use-package yasnippet-snippets)
      :init
      (yas-global-mode)
      )
#+end_src
*** Abbrev Mode
:PROPERTIES:
:END:
[[https://www.emacswiki.org/emacs/AbbrevMode#toc4][Abbrev Mode]] is very useful for expanding small text snippets

#+begin_src emacs-lisp
  (setq-default abbrev-mode 1)
  ;;  (load-file abbrev-file-name)
  (defadvice expand-abbrev (after my-expand-abbrev activate)
    ;; if there was an expansion
    (if ad-return-value
        ;; start idle timer to ensure insertion of abbrev activator
        ;; character (e.g. space) is finished
        (run-with-idle-timer 0 nil
                             (lambda ()
                               ;; if there is the string "%CHANGEME%" in the
                               ;; expansion then move cursor there and
                               ;; delete the string
                               (let ((cursor "%CHANGEME%"))
                                 (when (search-backward  cursor last-abbrev-location t)
                                   (goto-char  last-abbrev-location)
                                   (search-forward cursor)
                                   (backward-word)
                                   (highlight-symbol-at-point)
                                   (delete-char (length cursor))
                                   ))))))

#+end_src
