emacs-config.org
*** API docs
#+begin_src emacs-lisp
  (defun rgr/devdocs()
    "If in an emacs-lisp buffer or bable block use `rgr/elisp-lookup-reference' else devdocs."
    (interactive)
    (if (or (derived-mode-p  'emacs-lisp-mode) (and (eq
                                                     major-mode 'org-mode) (string= "emacs-lisp" (car (org-babel-get-src-block-info)))))
        (helpful-at-point)
      (let ((s (symbol-at-point)))
        (message "symbol-at-point: %s" s)
        (if (fboundp 'devdocs-browser-open)
            (devdocs-browser-open)
          (call-interactively 'devdocs-lookup (vector 't s ))))))
  (global-set-key (kbd "C-q")  'rgr/devdocs)

#+end_src

**** devdocs-browser

https://github.com/blahgeek/emacs-devdocs-browser :

Browse devdocs.io documents inside Emacs!

#+begin_src emacs-lisp
  (use-package devdocs-browser
    ;;:disabled t
    :custom
    (devdocs-data-dir (expand-file-name  "var/devdocs-browser"  user-emacs-directory))
    (devdocs-browser-cache-directory (expand-file-name  "var/devdocs-browser/cache"  user-emacs-directory))
    (devdocs-browser-data-directory (expand-file-name  "var/devdocs-browser/data" user-emacs-directory))
    :hook
    (c-ts-mode . (lambda()(setq-local devdocs-browser-active-docs '("c"))))
    (c++-ts-mode . (lambda()(setq-local devdocs-browser-active-docs '("cpp" "qt")))))
#+end_src



*** pdf-tools
:PROPERTIES:
:ID:       0646f2ee-757a-4001-ae4f-9f614805e33b
:END:
[[https://github.com/politza/pdf-tools][pdf-tools]] is, among other things, a replacement of DocView for PDF
files : faster, more otions and you can annotatePDFs. 
#+begin_src emacs-lisp
  (use-package pdf-tools
    :demand t
    :config
    (pdf-loader-install)
    :bind
    (:map pdf-view-mode-map
          ("&" . rgr/open-buffer-file-in-external-browser)))

#+end_src
**** requirements
#+begin_src bash
  sudo apt install libpng-dev zlib1g-dev libpoppler-glib-dev libpoppler-private-dev imagemagick
#+end_src

*** epub
#+begin_src emacs-lisp
  (use-package nov
    :demand t
    :config
    (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode)))

  ;; (use-package nov-xwidget
  ;;   :after nov
  ;;   :config
  ;;   (define-key nov-mode-map (kbd "o") 'nov-xwidget-view)
  ;;   (add-hook 'nov-mode-hook 'nov-xwidget-inject-all-files))

#+end_src

*** impatient-showdow, markdown view live
Preview markdown buffer live over HTTP using showdown.
https://github.com/jcs-elpa/impatient-showdown
#+begin_src emacs-lisp
  (use-package impatient-showdown
    :disabled
    :hook (markdown-mode . impatient-showdown-mode))
#+end_src

** Shells and Terminals
:PROPERTIES:
:END:
lookup and reference uilities and config

*** VTERM
#+begin_src  emacs-lisp
  (use-package vterm
    :ensure t)
  (use-package  multi-vterm
    :ensure t
    :commands (multi-vterm-project)
    :bind
    ("M-g t" . multi-vterm-project))
#+end_src


** Programming Language related                                 :programming:

*** tag matching
#+begin_src  emacs-lisp
  (use-package evil-matchit
    :bind
    ("M-(" . evilmi-jump-items-native))
#+end_src

*** consult xref stack
#+begin_src  emacs-lisp
  (use-package consult-xref-stack :ensure (:host github :repo "brett-lempereur/consult-xref-stack")
  :bind
  (("M-," . consult-xref-stack-backward)))
#+end_src


**** rmsbolt
RMSbolt is a compiler output viewer in Emacs.
https://github.com/emacsmirror/rmsbolt
#+begin_src emacs-lisp
  (use-package rmsbolt
    :demand t
    :init
    (defun rgr/rmsbolt()
      (interactive)
      (if (not rmsbolt-mode)
          (rmsbolt)
        (progn
          (rmsbolt-mode -1)
          (when (get-buffer rmsbolt-output-buffer)
              (with-current-buffer  rmsbolt-output-buffer
                (kill-buffer-and-window))))))
    :bind
    (:map prog-mode-map
          ("C-c d" . rgr/rmsbolt)))
#+end_src

**** parrot
#+begin_src emacs-lisp
  (use-package parrot
    :config
    (defun my/parrot-animate-when-compile-success (buffer result)
      (if (string-match "^finished" result)
          (parrot-start-animation)))    (parrot-mode)
    (add-to-list 'compilation-finish-functions 'my/parrot-animate-when-compile-success))
#+end_src


*** compilation
#+begin_src emacs-lisp
  (global-set-key (kbd "C-c C-r") 'recompile)
  (global-set-key (kbd "<f9>")
    '(lambda () (interactive)
        (condition-case nil (next-error)
           (error (next-error 1 t)))))
#+end_src
*** indent bars
#+begin_src  emacs-lisp
  (use-package indent-bars
    :disabled
    :ensure t
    :straight (indent-bars :type git :host github :repo "jdtsmith/indent-bars")
    :hook
    (prog-mode . indent-bars-mode))
#+end_src
*** JSON
#+begin_src  emacs-lisp
  (use-package json-mode)
  (use-package jsonrpc)
#+end_src

*** Treemacs
:PROPERTIES:
:ID:       ecaca0b4-39b3-4978-90f3-d07713c58516
:END:
#+begin_src emacs-lisp
  (use-package
    treemacs
    :init
    (add-to-list 'image-types 'svg)
    :custom
    (treemacs-follow-after-init t) ; hello
    :config
    (treemacs-follow-mode +1)
    (treemacs-fringe-indicator-mode)
    (treemacs-git-mode 'deferred)
    :bind
    ("M-9"   . 'treemacs-select-window)
    (:map treemacs-mode-map
          ("<right>" . treemacs-peek)))
  (use-package treemacs-magit
    :after treemacs)

#+end_src

*** HideShow
#+begin_src  emacs-lisp
  (use-package hideshow
    :ensure nil
    :hook
    (emacs-lisp-mode . hs-minor-mode)
    :bind
    (:map hs-minor-mode-map
          (("C-h t" . hs-toggle-hiding))))
#+end_src 

*** duplicate thing
#+begin_src emacs-lisp
  (use-package duplicate-thing
    :demand t
    :bind   ("C-S-d" . 'duplicate-thing))
#+end_src
*** Breadcrumbs
#+begin_src  emacs-lisp
  (use-package breadcrumb)
#+end_src
*** prog-mode hack
:PROPERTIES:
:ID:       2e3c4e82-1056-47ea-ba0a-e4492fe56709
:END:
#+begin_src emacs-lisp
  (unless (fboundp 'prog-mode)
    (defalias 'prog-mode 'fundamental-mode))
#+end_src
***  Show Line numbers
:PROPERTIES:
:ID:       1c88f735-c6b7-41d1-b7ea-b09b1e70b539
:END:
#+begin_src emacs-lisp
  (global-set-key (kbd "S-<f2>") 'display-line-numbers-mode)
  (add-hook 'prog-mode-hook (lambda() (display-line-numbers-mode t)))
#+end_src
*** code format
#+begin_src emacs-lisp
  ;; auto-format different source code files extremely intelligently
  ;; https://github.com/radian-software/apheleia
  (use-package apheleia
    :disabled
    :ensure t
    :config
    (apheleia-global-mode +1))
#+end_src
*** BASH                                                               :bash:
:PROPERTIES:
:ID:       4dd2f546-25a2-498f-ad8c-25a29c09a303
:END:
**** Navigating Bash set -x output
:PROPERTIES:
:ID:       043858ea-c607-49f5-bf6e-74622398d1e5
:END:
#+begin_src emacs-lisp
  ;; try to work with next-error for bash's "set -x" output
  (use-package compile
    :ensure nil
    :config
    (add-to-list 'compilation-error-regexp-alist
                 'bash-set-x)
    (add-to-list 'compilation-error-regexp-alist-alist
                 '(pascal
                   "\\(.+?\\)\\(\\([0-9]+\\),\\([0-9]+\\)\\).*" 1 2 3)))
#+end_src
*** PHP
#+begin_src  emacs-lisp
  (use-package php-mode)
#+end_src
*** JSON, YAML Configuration files                                     :json:
:PROPERTIES:
:ID:       7004e983-2669-43a2-9a59-449b6cbfe7d2
:END:
**** YAML
:PROPERTIES:
:ID:       26c28417-3965-452a-a180-61de98d44ef5
:END:
#+begin_src emacs-lisp
  (use-package yaml-mode)
#+end_src
**** json
#+begin_src emacs-lisp
  (use-package json-reformat)
  (use-package hydra)
#+end_src
*** Version Control
:PROPERTIES:
:ID:       c3959a2b-72b6-4dc0-ab9c-17e9a3b49fa1
:END:
**** It's [[Https://github.com/magit/magit][Magit]]! A Git porcelain inside Emacs
#+begin_src emacs-lisp
  (use-package transient)
  (use-package
    magit
    :after transient
    :bind
    ("C-x g" . magit-status))

#+end_src
**** [[https://github.com/magit/forge][Forge]] ahead with Pull Requests :forge:git:github:
always causes issues. disabled.
:PROPERTIES:
:ID:       ed290161-c9c1-455d-ac1a-927c906ab599
:END:
#+begin_src emacs-lisp :tangle no
  (straight-use-package 'sqlite3)
  (use-package forge
    :disabled
    :after magit)
#+end_src

