README.md


### API docs

    (defun rgr/devdocs()
      "If in an emacs-lisp buffer or bable block use `rgr/elisp-lookup-reference' else devdocs."
      (interactive)
      (if (or (derived-mode-p  'emacs-lisp-mode) (and (eq
                                                       major-mode 'org-mode) (string= "emacs-lisp" (car (org-babel-get-src-block-info)))))
          (helpful-at-point)
        (let ((s (symbol-at-point)))
          (message "symbol-at-point: %s" s)
          (if (fboundp 'devdocs-browser-open)
              (devdocs-browser-open)
            (call-interactively 'devdocs-lookup (vector 't s ))))))
    (global-set-key (kbd "C-q")  'rgr/devdocs)

1.  devdocs-browser

    <https://github.com/blahgeek/emacs-devdocs-browser> :
    
    Browse devdocs.io documents inside Emacs!
    
        (use-package devdocs-browser
          ;;:disabled t
          :custom
          (devdocs-data-dir (expand-file-name  "var/devdocs-browser"  user-emacs-directory))
          (devdocs-browser-cache-directory (expand-file-name  "var/devdocs-browser/cache"  user-emacs-directory))
          (devdocs-browser-data-directory (expand-file-name  "var/devdocs-browser/data" user-emacs-directory))
          :hook
          (c-ts-mode . (lambda()(setq-local devdocs-browser-active-docs '("c"))))
          (c++-ts-mode . (lambda()(setq-local devdocs-browser-active-docs '("cpp")))))


### pdf-tools

[pdf-tools](https://github.com/politza/pdf-tools) is, among other things, a replacement of DocView for PDF
files : faster, more otions and you can annotatePDFs. 

    (use-package pdf-tools
      :demand t
      :config
      (pdf-loader-install)
      :bind
      (:map pdf-view-mode-map
            ("&" . rgr/open-buffer-file-in-external-browser)))

1.  requirements

        sudo apt install libpng-dev zlib1g-dev libpoppler-glib-dev libpoppler-private-dev imagemagick


### epub

    (use-package nov
      :demand t
      :config
      (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode)))
    
    ;; (use-package nov-xwidget
    ;;   :after nov
    ;;   :config
    ;;   (define-key nov-mode-map (kbd "o") 'nov-xwidget-view)
    ;;   (add-hook 'nov-mode-hook 'nov-xwidget-inject-all-files))


### impatient-showdow, markdown view live

Preview markdown buffer live over HTTP using showdown.
<https://github.com/jcs-elpa/impatient-showdown>

    (use-package impatient-showdown
      :disabled
      :hook (markdown-mode . impatient-showdown-mode))


## Shells and Terminals

lookup and reference uilities and config


### VTERM

    (use-package vterm
      :ensure t)
    (use-package  multi-vterm
      :ensure t
      :commands (multi-vterm-project)
      :bind
      ("M-g t" . multi-vterm-project))


## Programming Language related


### tag matching

    (use-package evil-matchit
      :bind
      ("M-(" . evilmi-jump-items-native))


### consult xref stack

    (use-package consult-xref-stack :ensure (:host github :repo "brett-lempereur/consult-xref-stack")
    :bind
    (("M-," . consult-xref-stack-backward)))

1.  rmsbolt

    RMSbolt is a compiler output viewer in Emacs.
    <https://github.com/emacsmirror/rmsbolt>
    
        (use-package rmsbolt
          :demand t
          :init
          (defun rgr/rmsbolt()
            (interactive)
            (if (not rmsbolt-mode)
                (rmsbolt)
              (progn
                (rmsbolt-mode -1)
                (when (get-buffer rmsbolt-output-buffer)
                    (with-current-buffer  rmsbolt-output-buffer
                      (kill-buffer-and-window))))))
          :bind
          (:map prog-mode-map
                ("C-c d" . rgr/rmsbolt)))

2.  parrot

        (use-package parrot
          :config
          (defun my/parrot-animate-when-compile-success (buffer result)
            (if (string-match "^finished" result)
                (parrot-start-animation)))    (parrot-mode)
          (add-to-list 'compilation-finish-functions 'my/parrot-animate-when-compile-success))


### compilation

    (global-set-key (kbd "C-c C-r") 'recompile)
    (global-set-key (kbd "<f9>")
      '(lambda () (interactive)
          (condition-case nil (next-error)
             (error (next-error 1 t)))))


### indent bars

    (use-package indent-bars
      :disabled
      :ensure t
      :straight (indent-bars :type git :host github :repo "jdtsmith/indent-bars")
      :hook
      (prog-mode . indent-bars-mode))


### JSON

    (use-package json-mode)
    (use-package jsonrpc)


### Treemacs

    (use-package
      treemacs
      :init
      (add-to-list 'image-types 'svg)
      :custom
      (treemacs-follow-after-init t) ; hello
      :config
      (treemacs-follow-mode +1)
      (treemacs-fringe-indicator-mode)
      (treemacs-git-mode 'deferred)
      :bind
      ("M-9"   . 'treemacs-select-window)
      (:map treemacs-mode-map
            ("<right>" . treemacs-peek)))
    (use-package treemacs-magit
      :after treemacs)


### HideShow

    (use-package hideshow
      :ensure nil
      :hook
      (emacs-lisp-mode . hs-minor-mode)
      :bind
      (:map hs-minor-mode-map
            (("C-h t" . hs-toggle-hiding))))


### duplicate thing

    (use-package duplicate-thing
      :demand t
      :bind   ("C-S-d" . 'duplicate-thing))


### Breadcrumbs

    (use-package breadcrumb)


### prog-mode hack

    (unless (fboundp 'prog-mode)
      (defalias 'prog-mode 'fundamental-mode))


### Show Line numbers

    (global-set-key (kbd "S-<f2>") 'display-line-numbers-mode)
    (add-hook 'prog-mode-hook (lambda() (display-line-numbers-mode t)))


### code format

    ;; auto-format different source code files extremely intelligently
    ;; https://github.com/radian-software/apheleia
    (use-package apheleia
      :disabled
      :ensure t
      :config
      (apheleia-global-mode +1))


### BASH

1.  Navigating Bash set -x output

        ;; try to work with next-error for bash's "set -x" output
        (use-package compile
          :ensure nil
          :config
          (add-to-list 'compilation-error-regexp-alist
                       'bash-set-x)
          (add-to-list 'compilation-error-regexp-alist-alist
                       '(pascal
                         "\\(.+?\\)\\(\\([0-9]+\\),\\([0-9]+\\)\\).*" 1 2 3)))


### PHP

    (use-package php-mode)


### JSON, YAML Configuration files

1.  YAML

        (use-package yaml-mode)

2.  json

        (use-package json-reformat)
        (use-package hydra)


### Version Control

1.  It's [Magit](Https://github.com/magit/magit)! A Git porcelain inside Emacs

        (use-package transient)
        (use-package
          magit
          :after transient
          :bind
          ("C-x g" . magit-status))

2.  [Forge](https://github.com/magit/forge) ahead with Pull Requests

    always causes issues. disabled.
    
    :ID:       ed290161-c9c1-455d-ac1a-927c906ab599
    
        (straight-use-package 'sqlite3)
        (use-package forge
          :disabled
          :after magit)
    
    1.  token
    
        &#x2013;&#x2014;BEGIN PGP MESSAGE&#x2013;&#x2014;
