emacs-config.org
***** token                                                           :crypt:
-----BEGIN PGP MESSAGE-----

hQEMA7IjL5SkHG4iAQgAhMUIMTYGMMJOxJT9Cpd4yXSe7D3nYO1JLdyFFADgiHDq
1D68ig/iJdH5aPZNmKOOqSeI3zObJjDOnQ95+PK+DBDaDHlwJ/LWYdR/A4eWAh5G
WcRqCn+diQ/amAXuaISDLBCpEa/GKS3kHObVf41VwL43INMAwssDI2rOFnhOEUWF
jAWKyhzcS/D+1BqxV5XcloY8tn8qCZbLHOi1+YKr+ZeefFtJtmaqQtyjt6P1Z+H/
eCvdX0P4JdMm9Lp/fbzDQOPo8QVuWLKAWphMSfgCqetR5gfz9W/3+fcqzOP3amnt
qTM3K7LywQOeiJhLgyhw5bemiEXIKuNygb7Wmmv5xNKEAc5/QrR0YnZIuEnDN4Gb
aPjOOiu73X7xh76DX+5CxBXhQZzYtnqD8ctuenIMgvbD9AY1+H4fU0Wv6qGi9uNh
Y0lSPvXH7dBCTWu2rSWhIvgCQfv6Nihs3Jc455oZgajN7G/rgZNb0ER8YTYncZjY
gtVhIJfSArVFXuCGLnZMoMHSC4rV
=MsQY
-----END PGP MESSAGE-----
**** Git Window Gutter Support
:PROPERTIES:
:ID:       0ea55ead-920a-45dd-add1-08ce1a24c512
:END:
***** diff-hl mode
#+begin_src emacs-lisp
  (use-package diff-hl
    :demand t
    :hook
    (elpaca-after-init .  global-diff-hl-mode)
    (magit-post-refresh . diff-hl-magit-post-refresh))
#+end_src
***  AI
**** gptel
#+begin_src  emacs-lisp
  (use-package gptel
    :custom
    (gptel-model 'gemini-2.5-pro)
    (gptel-default-mode 'org-mode)
    :config
    (setq gptel-backend (gptel-make-gemini "Gemini"
                                           :key (get-auth-info "api.openai.com" "apikey")
                                           :stream t))
    :bind
    ("C-c q" . gptel-send))
#+end_src
**** Aider
#+begin_src  emacs-lisp
  (use-package aider :ensure (:host github :repo "tninja/aider.el")
    :config
    (setenv "GEMINI_API_KEY" (get-auth-info "api.openai.com" "apikey"))
    (setq aider-args `("--model" "gemini-2.5-pro"))
    ;;(global-set-key (kbd "C-c a") 'aider-transient-menu) ;; for wider screen
    (aider-magit-setup-transients))
#+end_src 
**** Claude
#+begin_src  emacs-lisp
    ;; install claude-code.el
  (use-package claude-code :ensure (:host github :repo "stevemolitor/claude-code.el")
    ;; optional hook for Monet IDE integration:
    :hook (claude-code-process-environment-functions . monet-start-server-function)
    :config 
    ;;(monet-mode 1) ; optional IDE integration
    (claude-code-mode)
    :bind-keymap ("C-c c" . claude-code-command-map))
  
#+end_src 

*** Tree Sitter
Automatically install and use tree-sitter major modes in Emacs 29+. If the tree-sitter version cant be used, fall back to the original major mode.
#+begin_src  emacs-lisp
  (use-package treesit-auto
    :custom
    (treesit-auto-install t)
    :config
    (treesit-auto-add-to-auto-mode-alist 'all)
    (global-treesit-auto-mode))
#+end_src

*** Javascript                                                           :js:
:PROPERTIES:
:ID:       27571c84-2c40-487d-abd0-3013c53b731b
:END:
#+begin_src emacs-lisp
  (use-package js
    :ensure nil
    :demand t
    :init
    (add-to-list 'auto-mode-alist '("\\.mjs" . javascript-mode)) ;; js module file
    (defun rgr/javascript-typescript-common-mode-hook ()
      (electric-pair-mode 1)
      (setq-local rgr/complete-line-f 'rgr/complete-c-line)
      )
    :config
    (defun rgr/js-ts-mode-hook ()
      )
    :hook
    (js-ts-mode . rgr/javascript-typescript-common-mode-hook)
    (js-ts-mode . rgr/js-ts-mode-hook))
#+end_src

*** Typescript
#+begin_src emacs-lisp
  (use-package typescript-ts-mode
    :ensure nil
    :demand t
    :init
    (defun rgr/typescript-ts-mode-hook ()
      )
    :hook
    (typescript-ts-mode .  rgr/javascript-typescript-common-mode-hook)
    (typescript-ts-mode .  rgr/typescript-ts-mode-hook))
#+end_src

*** Kotlin
#+begin_src emacs-lisp
  (use-package kotlin-ts-mode
    :demand t
    :init
    (defun rgr/kotlin-ts-mode-hook ()
      (eglot-ensure)
      )
    (add-to-list 'auto-mode-alist '("\\.kt\\'" . kotlin-ts-mode))
    :hook
    (kotlin-ts-mode .  rgr/kotlin-ts-mode-hook))
#+end_src 
*** Language Server Protocol (LSP)                                      :lsp:
:PROPERTIES:
:END:
[[https://github.com/emacs-lsp][Emacs-lsp]] : Language Server Protocol client for Emacs

***** eglot
Emacs lsp client
https://github.com/joaotavora/eglot
#+begin_src emacs-lisp
  (use-package eglot
    :custom
    (eglot-autoshutdown t)
    (eglot-send-changes-idle-time 0.5)
    ;;(eglot-ignored-server-capabilities '( :documentHighlightProvider));; dont let eglot/eldoc show doc, rather flymake.
    :config
    ;;(add-hook  'eglot-stay-out-of 'yasnippet)
    (advice-add 'eglot-completion-at-point :around #'cape-wrap-buster)
    (defun rgr/eglot-on-save()
      (when eglot--managed-mode
        ;;(eglot-format-buffer)
        )
      )
    (defun rgr/eglot-managed-mode-hook()
      (hs-minor-mode t)
      (auto-fill-mode t)
      (flymake-mode -1)
      (if (featurep 'breadcrumb)
          (breadcrumb-local-mode)))
    :hook
    (eglot-stay-out-of . company)
    (before-save . rgr/eglot-on-save)
    (eglot-managed-mode . rgr/eglot-managed-mode-hook)
    ((js-ts-mode c-ts-mode c++-ts-mode php-mode auctex-mode) . #'eglot-ensure)
    :bind
    (:map eglot-mode-map (
          ("C-<return>" . eglot-code-actions))))

  ;; emacs 30 makes this redundant.
  (when (< emacs-major-version 30)
    (use-package eglot-booster :ensure (:host github :repo "jdtsmith/eglot-booster")
      :after eglot
      :config	(eglot-booster-mode)))

#+end_src

***** dape
#+begin_src  emacs-lisp
  (use-package dape
    :demand t
    :custom
    (dape-default-breakpoints-file (expand-file-name  "var/dape/dape-breakpoints" user-emacs-directory ))
    (dape-buffer-window-arrangement 'right)
    (dape-info-hide-mode-line nil)
    (dape-inlay-hints t)
    ;;(dape-cwd-fn 'projectile-project-root)
    :hook
    ;;(dape-start . dape-breakpoint-load)
    (dape-display-source . pulsar-pulse-line)
    (dape-compile .  kill-buffer)

    :config
    ;; Turn on global bindings for setting breakpoints with mouse
    ;; (advice-add 'dape-quit :after (lambda(&rest r)(dape-breakpoint-save dape-default-breakpoints-file)))
    (add-to-list 'recentf-exclude "dape-breakpoints")
    (add-to-list 'recentf-exclude "var/org")
    (dape-breakpoint-global-mode)
    (add-hook 'dape-info-parent-mode-hook
              (defun dape--info-rescale ()
                (face-remap-add-relative 'default :height 0.8))))

#+end_src


*** Serial Port
:PROPERTIES:
:END:
#+begin_src emacs-lisp
  (defgroup rgr/serial-ports nil
    "serial port customization"
    :group 'rgr)

  (defcustom rgr/serialIOPort "/dev/ttyACM0"
    "Serial device for emacs to display"
    :type 'string
    :group 'rgr/serial-ports)

  (defcustom rgr/serialIOPortBaud 9600
    "Default serial baud rate"
    :type 'integer
    :group 'rgr/serial-ports)

  (defun selectSerialPortBuffer()
    (setq ser (get-buffer rgr/serialIOPort))
    (if ser (switch-to-buffer ser)
      (serial-term rgr/serialIOPort rgr/serialIOPortBaud)))

  (global-set-key (kbd "C-c s")
                  (lambda()
                    (interactive)
                    (selectSerialPortBuffer)))
#+end_src
*** PlatformIO
:PROPERTIES:
:END:
[[https://github.com/emacsmirror/platformio-mode][platformio-mode]] is an Emacs minor mode which allows quick building and uploading of PlatformIO projects with a few short key sequences.
The build and install process id documented [[https://docs.platformio.org/en/latest/ide/emacs.html][here]].
#+begin_src emacs-lisp
  (use-package platformio-mode
    :disabled t
    :custom

    (platformio-mode-silent nil)
    :init
    (require 'ansi-color)
    (defun rgr/platformio-compilation-mode-filter (buf _)
      (interactive)
      (with-current-buffer buf
        (when (derived-mode-p 'platformio-compilation-mode)
          (let ((inhibit-read-only t))
            (ansi-color-apply-on-region (point-min) (point-max))))))

    (add-hook 'compilation-finish-functions
              'rgr/platformio-compilation-mode-filter))
#+end_src
**** CANCELLED [#A] get compilation errors to work and submit ansi color fix? :CANCELLED:
CLOSED: [2023-11-27 Mon 04:59] SCHEDULED: <2021-09-26 Sun>
:LOGBOOK:
- State "CANCELLED"  from "TODO"       [2023-11-27 Mon 04:59]
- State "TODO"       from              [2021-09-26 Sun 21:13]
:END:
*** Python                                                           :python:
:PROPERTIES:
:ID:       2c18bd9b-6244-4c67-841e-c82a5270b1ba
:END:
**** ipython
:LOGBOOK:
- State "SOMEDAY"    from              [2021-04-03 Sa 09:41]
:END:
#+begin_src emacs-lisp
  (setq python-shell-interpreter "ipython")
  (setq python-shell-interpreter-args "-i --simple-prompt --InteractiveShell.display_page=True")
#+end_src
**** PET                                                     :virtualenv:pet:
#+begin_src emacs-lisp
  (use-package pet
    :config
    (add-hook 'python-base-mode-hook 'pet-mode -10))
#+end_src
*** Haskell                                                          :python:
