README.md
        
        hQEMA7IjL5SkHG4iAQgAhMUIMTYGMMJOxJT9Cpd4yXSe7D3nYO1JLdyFFADgiHDq
        1D68ig/iJdH5aPZNmKOOqSeI3zObJjDOnQ95+PK+DBDaDHlwJ/LWYdR/A4eWAh5G
        WcRqCn+diQ/amAXuaISDLBCpEa/GKS3kHObVf41VwL43INMAwssDI2rOFnhOEUWF
        jAWKyhzcS/D+1BqxV5XcloY8tn8qCZbLHOi1+YKr+ZeefFtJtmaqQtyjt6P1Z+H/
        eCvdX0P4JdMm9Lp/fbzDQOPo8QVuWLKAWphMSfgCqetR5gfz9W/3+fcqzOP3amnt
        qTM3K7LywQOeiJhLgyhw5bemiEXIKuNygb7Wmmv5xNKEAc5/QrR0YnZIuEnDN4Gb
        aPjOOiu73X7xh76DX+5CxBXhQZzYtnqD8ctuenIMgvbD9AY1+H4fU0Wv6qGi9uNh
        Y0lSPvXH7dBCTWu2rSWhIvgCQfv6Nihs3Jc455oZgajN7G/rgZNb0ER8YTYncZjY
        gtVhIJfSArVFXuCGLnZMoMHSC4rV
        =MsQY
        &#x2013;&#x2014;END PGP MESSAGE&#x2013;&#x2014;

3.  Git Window Gutter Support

    1.  diff-hl mode
    
            (use-package diff-hl
              :demand t
              :hook
              (elpaca-after-init .  global-diff-hl-mode)
              (magit-post-refresh . diff-hl-magit-post-refresh))


### Tree Sitter

Automatically install and use tree-sitter major modes in Emacs 29+. If the tree-sitter version can’t be used, fall back to the original major mode.

    (use-package treesit-auto
      :custom
      (treesit-auto-install t)
      :config
      (treesit-auto-add-to-auto-mode-alist 'all)
      (global-treesit-auto-mode))


### Javascript

    (use-package js
      :ensure nil
      :demand t
      :init
      (add-to-list 'auto-mode-alist '("\\.mjs" . javascript-mode)) ;; js module file
      (defun rgr/javascript-typescript-common-mode-hook ()
        (electric-pair-mode 1)
        (setq-local rgr/complete-line-f 'rgr/complete-c-line)
        )
      :config
      (defun rgr/js-ts-mode-hook ()
        )
      :hook
      (js-ts-mode . rgr/javascript-typescript-common-mode-hook)
      (js-ts-mode . rgr/js-ts-mode-hook))


### Typescript

    (use-package typescript-ts-mode
      :ensure nil
      :demand t
      :init
      (defun rgr/typescript-ts-mode-hook ()
        )
      :hook
      (typescript-ts-mode .  rgr/javascript-typescript-common-mode-hook)
      (typescript-ts-mode .  rgr/typescript-ts-mode-hook))


### Language Server Protocol (LSP)

[Emacs-lsp](https://github.com/emacs-lsp) : Language Server Protocol client for Emacs

1.  eglot

    Emacs lsp client
    <https://github.com/joaotavora/eglot>
    
        (use-package eglot
          :custom
          (eglot-autoshutdown t)
          (eglot-send-changes-idle-time 0.5)
          (eglot-ignored-server-capabilities '( :documentHighlightProvider));; dont let eglot/eldoc show doc, rather flymake.
          :config
          ;;(add-hook  'eglot-stay-out-of 'yasnippet)
          (advice-add 'eglot-completion-at-point :around #'cape-wrap-buster)
          (defun rgr/eglot-on-save()
            (when eglot--managed-mode
              (eglot-format-buffer)
              )
            )
          (defun rgr/eglot-managed-mode-hook()
            (hs-minor-mode t)
            (auto-fill-mode t)
            (if (featurep 'breadcrumb)
                (breadcrumb-local-mode)))
          :hook
          (eglot-stay-out-of . company)
          (before-save . rgr/eglot-on-save)
          (eglot-managed-mode . rgr/eglot-managed-mode-hook)
          ((js-ts-mode c-ts-mode c++-ts-mode php-mode auctex-mode) . #'eglot-ensure)
          :bind
          (:map eglot-mode-map (
                ("C-<return>" . eglot-code-actions))))
        (use-package eglot-booster :ensure (:host github :repo "jdtsmith/eglot-booster")
          :after eglot
          :config	(eglot-booster-mode))

2.  dape

        (use-package dape
          :demand t
          :custom
          (dape-default-breakpoints-file (expand-file-name  "var/dape/dape-breakpoints" user-emacs-directory ))
          (dape-buffer-window-arrangement 'right)
          (dape-info-hide-mode-line nil)
          (dape-inlay-hints t)
          ;;(dape-cwd-fn 'projectile-project-root)
          :hook
          ;;(dape-start . dape-breakpoint-load)
          (dape-display-source . pulsar-pulse-line)
          (dape-compile .  kill-buffer)
        
          :config
          ;; Turn on global bindings for setting breakpoints with mouse
          ;; (advice-add 'dape-quit :after (lambda(&rest r)(dape-breakpoint-save dape-default-breakpoints-file)))
          (add-to-list 'recentf-exclude "dape-breakpoints")
          (add-to-list 'recentf-exclude "var/org")
          (dape-breakpoint-global-mode)
          (add-hook 'dape-info-parent-mode-hook
                    (defun dape--info-rescale ()
                      (face-remap-add-relative 'default :height 0.8))))


### Serial Port

    (defgroup rgr/serial-ports nil
      "serial port customization"
      :group 'rgr)
    
    (defcustom rgr/serialIOPort "/dev/ttyACM0"
      "Serial device for emacs to display"
      :type 'string
      :group 'rgr/serial-ports)
    
    (defcustom rgr/serialIOPortBaud 9600
      "Default serial baud rate"
      :type 'integer
      :group 'rgr/serial-ports)
    
    (defun selectSerialPortBuffer()
      (setq ser (get-buffer rgr/serialIOPort))
      (if ser (switch-to-buffer ser)
        (serial-term rgr/serialIOPort rgr/serialIOPortBaud)))
    
    (global-set-key (kbd "C-c s")
                    (lambda()
                      (interactive)
                      (selectSerialPortBuffer)))


### PlatformIO

[platformio-mode](https://github.com/emacsmirror/platformio-mode) is an Emacs minor mode which allows quick building and uploading of PlatformIO projects with a few short key sequences.
The build and install process id documented [here](https://docs.platformio.org/en/latest/ide/emacs.html).

    (use-package platformio-mode
      :disabled t
      :custom
    
      (platformio-mode-silent nil)
      :init
      (require 'ansi-color)
      (defun rgr/platformio-compilation-mode-filter (buf _)
        (interactive)
        (with-current-buffer buf
          (when (derived-mode-p 'platformio-compilation-mode)
            (let ((inhibit-read-only t))
              (ansi-color-apply-on-region (point-min) (point-max))))))
    
      (add-hook 'compilation-finish-functions
                'rgr/platformio-compilation-mode-filter))


### Python

1.  ipython

        (setq python-shell-interpreter "ipython")
        (setq python-shell-interpreter-args "-i --simple-prompt --InteractiveShell.display_page=True")

2.  PET

        (use-package pet
          :config
          (add-hook 'python-base-mode-hook 'pet-mode -10))
