emacs-config.org
**** haskell-mode
#+begin_src emacs-lisp
  ;; I'm typically confused when it comes to haskell. Note that the interactive stuff I cribbed doesnt work.
  (use-package haskell-mode
    :disabled t
    :config
    (eval-after-load "haskell-mode"
      '(define-key haskell-mode-map (kbd "C-c C-c") 'haskell-compile))
    (eval-after-load "haskell-cabal"
      '(define-key haskell-cabal-mode-map (kbd "C-c C-c") 'haskell-compile))
    (add-hook 'haskell-mode-hook 'interactive-haskell-mode))
#+end_src
*** lldb debugging in emacs                          :lldb:llvm:voltron:tmux:
**** voltron
#+begin_src emacs-lisp
  (use-package lldb-voltron :disabled t
    :straight (lldb-voltron :local-repo "~/development/emacs/emacs-lldb-voltron" :type git :host github :repo "rileyrg/emacs-lldb-voltron" )
    ;;:config
    ;; (breadcrumb-mode t)
    )
#+end_src
*** rust
#+begin_src emacs-lisp

  (use-package rust-mode
    :disabled t
    :ensure t
    :init
    (defcustom rgr/rust-browser-doc-url (concat (format "file://%s/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/share/doc/rust/html/std/index.html?search=" (getenv "HOME")) "%s") "used to format variable `rgr/browser-doc-url'")
    (setq rust-mode-treesitter-derive t))

  (use-package rustic
    :disabled t
    :ensure t
    :after (rust-mode)
    :custom
    (rustic-cargo-use-last-stored-arguments t)
    :config
    (setq rustic-format-on-save t)
    (add-to-list 'rgr/eww-external-launch-url-chunks "doc/rust")
    (defun rgr/rust-mode-hook ()
      (message "rgr/rust-mode-hook")
      (setq-local rgr/browser-doc-url rgr/rust-browser-doc-url)
      (setq-local rgr/complete-line-f 'rgr/c-complete-line)
      (setq indent-tabs-mode nil)
      (prettify-symbols-mode))
    :hook
    (rustic-mode . rgr/rust-mode-hook)
    :bind
    (:map rustic-mode-map
          ("C-q" . rgr/browser-doc-search)))

#+end_src
*** C and CPP                                                             :c:
:PROPERTIES:
:ID:       6aa8065f-66b4-4c1f-8994-0a1723eb055d
:END:
**** c-mode-common-hook

#+begin_src emacs-lisp
  (use-package flymake-cppcheck
    :disabled t
    :ensure (:host github :repo "https://github.com/flymake/flymake-cppcheck")
    :custom
    (flymake-cppcheck-enable "error,warning,performance,information,style")
    :hook
      ((c-ts-mode c++-ts-mode) . flymake-cppcheck-load))

  (use-package c-ts-mode
    :ensure nil
    :config
    (defun rgr/c-ts-mode-common-hook ()
      (message "rgr/c-ts-mode-common-hook")
      (yas-minor-mode t) ;; This SHOULD be done by eglot but it doesn't work
      (setq-local rgr/complete-line-f 'rgr/c-complete-line)
      (setq-local c-ts-mode-indent-offset 4))
    :hook
    ((c-ts-mode c++-ts-mode) . rgr/c-ts-mode-common-hook))

  

#+end_src
**** cmake
#+begin_src  emacs-lisp
  (setq auto-mode-alist
          (append
           '(("CMakeLists\\.txt\\'" . cmake-mode))
           '(("\\.cmake\\'" . cmake-mode))
           auto-mode-alist))
#+end_src 
*** Linux tools
:PROPERTIES:
:END:
**** [[https://github.com/doublep/logview][logview]] - view system logfiles
:PROPERTIES:
:ID:       bfd57f96-8cc4-41a1-81ab-e683345664e1
:END:
#+begin_src emacs-lisp
  (use-package logview
    :demand t
    :init
    (add-to-list 'auto-mode-alist '("\\.log\\'" . logview-mode))
    (add-to-list 'auto-mode-alist '("log\\'" . logview-mode)))
#+end_src
*** Assembler
:PROPERTIES:
:ID:       2bc81dc1-4f5f-47b9-9446-464af96a2365
:END:
**** [[https://nullprogram.com/blog/2015/11/21/][x86Lookup]]
:PROPERTIES:
:ID:       feb458b6-b2ab-4553-b2d9-95c121b29e7e
:END:
#+begin_src emacs-lisp
  (use-package strace-mode)
#+end_src
*** Web,Symfony and Twig
:PROPERTIES:
:ID:       5c88e4a3-3af1-42e4-81ec-913b4fa88853
:END:
**** Tasks                                                         :tasklist:
:PROPERTIES:
:ID:       0d8f29bf-bbd2-4387-a8fa-e2907704dc82
:END:

*** elf-mode - view the symbol list in a binary
:PROPERTIES:
:ID:       41cf30f2-5a70-4aab-aa93-2bd9a249b72f
:END:
[[https://oremacs.com/2016/08/28/elf-mode/][https://oremacs.com/2016/08/28/elf-mode/]]

#+begin_src emacs-lisp
  (use-package elf-mode
    :demand t
    :config
    (elf-setup-default))

#+end_src

** Emacs Lisp, ELisp Utils                                      :elisp:utils:
:PROPERTIES:
:ID:       eb119ffb-f073-4fe0-a8f4-b031291d9e4d
:END:
*** helpful, enriched elisp help
:PROPERTIES:
:ID:       e5517321-9188-4c5f-abfe-6511580c6193
:END:
#+begin_src emacs-lisp
  (use-package helpful
    :bind
    ("C-h f" . #'helpful-callable)
    ("C-h v" . #'helpful-variable)
    ("C-h k" . #'helpful-key)
    ("C-h x" . #'helpful-command))
#+end_src
*** guitar
#+begin_src  emacs-lisp
  (use-package fretboard
    :ensure (:host github :repo "skyefreeman/fretboard.el"))
#+end_src

*** bracket matching
#+begin_src  emacs-lisp
  (show-paren-mode 1)
  (setq blink-matching-delay 2.5)

  (electric-pair-mode 1)
  (setq electric-pair-inhibit-predicate
        (lambda (c)
          (if (char-equal c ?\") t (electric-pair-default-inhibit c))))

  ;; stolen from emacs info
  (defun rgr/match-paren (arg)
    "Go to the matching paren if on a paren; otherwise insert %."
    (interactive "p")
    (cond ((looking-at "\\s(") (forward-list 1) (backward-char 1))
          ((looking-at "\\s)") (forward-char 1) (backward-list 1))
          (t (self-insert-command (or arg 1)))))

  (global-set-key (kbd "%") 'rgr/match-paren)
#+end_src

*** kill-dwim
#+begin_src emacs-lisp
  (setq load-path (cons (expand-file-name "kill-dwim" rgr/emacs-project-dir ) load-path))
  (use-package kill-dwim
    :ensure nil
    :bind
    ("M-w" . kill-dwim))
#+end_src

*** Flymake
#+begin_src  emacs-lisp
  (use-package flymake
    :disabled t
    :custom
    (flymake-show-diagnostics-at-end-of-line nil)
    (flymake-no-changes-timeout 1.5)
    :config
      (use-package flymake-easy)
    :bind
    ("M-n" . flymake-goto-next-error)
    ("M-p" . flymake-goto-prev-error))
#+end_src
*** Flycheck
#+begin_src  emacs-lisp
  (use-package flycheck
    :ensure t
    :custom
    (flycheck-auto-display-errors-after-checking nil)
    :init (global-flycheck-mode)
    :bind
    ("M-n" . flycheck-next-error)
    ("M-p" . flycheck-prev-error))

  (use-package flycheck-inline
    :disabled t
    :after flycheck
    :config
    (add-hook 'flycheck-mode-hook #'flycheck-inline-mode))

  (use-package flycheck-posframe
    :ensure t
    :after flycheck
    :config
    (add-hook 'flycheck-mode-hook #'flycheck-posframe-mode))


#+end_src

**** shellcheck
#+begin_src emacs-lisp
  (use-package flymake-shellcheck
    :disabled t
    :commands flymake-shellcheck-load
    :init
    (defun rgr/sh-mode-hook()
      (flymake-shellcheck-load)
      (flymake-mode +1))
    :hook (sh-mode . rgr/sh-mode-hook))
#+end_src

***** external info files
#+begin_src emacs-lisp :tangle no
  (require 'info)
  (add-to-list 'Info-directory-list (expand-file-name  "var/info" user-emacs-directory))
#+end_src

**** elisp checks
:PROPERTIES:
:ID:       ca5b425c-df7f-47e9-a095-a5c59159ceb4
:END:
#+begin_src emacs-lisp
  (defun rgr/elisp-edit-mode()
    "return non nil if this buffer edits elisp"
    (member major-mode '(emacs-lisp-mode lisp-interaction-mode)))
#+end_src
**** linting                                                           :lint:
:PROPERTIES:
:ID:       2f4d8bac-b94c-4bd8-bf58-b08cb86bc0a7
:END:
[[https://github.com/purcell/package-lint][package-lint]] provides a linter for the metadata in Emacs Lisp files which are intended to be packages. You can integrate it into your build process.
#+begin_src emacs-lisp
  (use-package package-lint)
#+end_src
**** elisp popup context help                                   :popup:elisp:
:LOGBOOK:
- State "STARTED"    from "CANCELLED"  [2021-04-20 Di 08:11]
- State "CANCELLED"  from              [2021-04-20 Di 01:04] \\
  eldoc-box does this
:END:
Display a poup containing docstring at point
#+begin_src emacs-lisp
  (setq load-path (cons (expand-file-name "el-docstring-sap" rgr/emacs-project-dir ) load-path))
  (use-package el-docstring-sap
    :disabled t
    :after (eldoc posframe)
    :ensure nil
    :hook
    (emacs-lisp-mode . el-docstring-sap-mode)
    :bind
    ("M-<f2>" . el-docstring-sap-display)
    ("M-<f1>" . el-docstring-sap-mode))

#+end_src
**** Elisp debugging
:PROPERTIES:
:ID:       8cde63d8-6be5-4f70-84f5-a9d1d1c85386
:END:
***** edebug
#+begin_src emacs-lisp
  (use-package edebug-x
    :custom
    (debugger-stack-frame-as-list t)
    ;;(edebug-trace nil)
    :config
    (defun rgr/instrumentForDebugging() "use the universal prefix arg (C-u) to remove instrumentation"
           (interactive)
           (if current-prefix-arg (eval-defun nil)
             (eval-defun 0)))
    :bind
    ("C-S-<f9>" . toggle-debug-on-error)
    ("C-<f9>" . rgr/instrumentForDebugging))
#+end_src
