README.md


### Haskell

1.  haskell-mode

        ;; I'm typically confused when it comes to haskell. Note that the interactive stuff I cribbed doesnt work.
        (use-package haskell-mode
          :disabled t
          :config
          (eval-after-load "haskell-mode"
            '(define-key haskell-mode-map (kbd "C-c C-c") 'haskell-compile))
          (eval-after-load "haskell-cabal"
            '(define-key haskell-cabal-mode-map (kbd "C-c C-c") 'haskell-compile))
          (add-hook 'haskell-mode-hook 'interactive-haskell-mode))


### lldb debugging in emacs

1.  voltron

        (use-package lldb-voltron :disabled t
          :straight (lldb-voltron :local-repo "~/development/emacs/emacs-lldb-voltron" :type git :host github :repo "rileyrg/emacs-lldb-voltron" )
          ;;:config
          ;; (breadcrumb-mode t)
          )


### rust

    
    (use-package rust-mode
      :disabled t
      :ensure t
      :init
      (defcustom rgr/rust-browser-doc-url (concat (format "file://%s/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/share/doc/rust/html/std/index.html?search=" (getenv "HOME")) "%s") "used to format variable `rgr/browser-doc-url'")
      (setq rust-mode-treesitter-derive t))
    
    (use-package rustic
      :disabled t
      :ensure t
      :after (rust-mode)
      :custom
      (rustic-cargo-use-last-stored-arguments t)
      :config
      (setq rustic-format-on-save t)
      (add-to-list 'rgr/eww-external-launch-url-chunks "doc/rust")
      (defun rgr/rust-mode-hook ()
        (message "rgr/rust-mode-hook")
        (setq-local rgr/browser-doc-url rgr/rust-browser-doc-url)
        (setq-local rgr/complete-line-f 'rgr/c-complete-line)
        (setq indent-tabs-mode nil)
        (prettify-symbols-mode))
      :hook
      (rustic-mode . rgr/rust-mode-hook)
      :bind
      (:map rustic-mode-map
            ("C-q" . rgr/browser-doc-search)))


### C and CPP

1.  c-mode-common-hook

        (use-package c-ts-mode
          :ensure nil
          :config
          (defun rgr/c-ts-mode-common-hook ()
            (message "rgr/c-ts-mode-common-hook")
            (yas-minor-mode t) ;; This SHOULD be done by eglot but it doesn't work
            (setq-local rgr/complete-line-f 'rgr/c-complete-line)
            (setq-local c-ts-mode-indent-offset 4))
          :hook
          ((c-ts-mode c++-ts-mode) . rgr/c-ts-mode-common-hook))

2.  cmake

        (setq auto-mode-alist
                (append
                 '(("CMakeLists\\.txt\\'" . cmake-mode))
                 '(("\\.cmake\\'" . cmake-mode))
                 auto-mode-alist))


### Linux tools

1.  [logview](https://github.com/doublep/logview) - view system logfiles

        (use-package logview
          :demand t
          :init
          (add-to-list 'auto-mode-alist '("\\.log\\'" . logview-mode))
          (add-to-list 'auto-mode-alist '("log\\'" . logview-mode)))


### Assembler

1.  [x86Lookup](https://nullprogram.com/blog/2015/11/21/)

        (use-package strace-mode)


### Web,Symfony and Twig


### elf-mode - view the symbol list in a binary

[https://oremacs.com/2016/08/28/elf-mode/](https://oremacs.com/2016/08/28/elf-mode/)

    (use-package elf-mode
      :demand t
      :config
      (elf-setup-default))


## Emacs Lisp, ELisp Utils


### helpful, enriched elisp help

    (use-package helpful
      :bind
      ("C-h f" . #'helpful-callable)
      ("C-h v" . #'helpful-variable)
      ("C-h k" . #'helpful-key)
      ("C-h x" . #'helpful-command))


### bracket matching

    (show-paren-mode 1)
    (setq blink-matching-delay 2.5)
    
    (electric-pair-mode 1)
    (setq electric-pair-inhibit-predicate
          (lambda (c)
            (if (char-equal c ?\") t (electric-pair-default-inhibit c))))
    
    ;; stolen from emacs info
    (defun rgr/match-paren (arg)
      "Go to the matching paren if on a paren; otherwise insert %."
      (interactive "p")
      (cond ((looking-at "\\s(") (forward-list 1) (backward-char 1))
            ((looking-at "\\s)") (forward-char 1) (backward-list 1))
            (t (self-insert-command (or arg 1)))))
    
    (global-set-key (kbd "%") 'rgr/match-paren)


### kill-dwim

    (setq load-path (cons (expand-file-name "kill-dwim" rgr/emacs-project-dir ) load-path))
    (use-package kill-dwim
      :ensure nil
      :bind
      ("M-w" . kill-dwim))


### Flymake

    (use-package flymake
      :custom
      (flymake-show-diagnostics-at-end-of-line nil)
      (flymake-no-changes-timeout 1.5)
      :bind
      ("M-n" . flymake-goto-next-error)
      ("M-p" . flymake-goto-prev-error))

1.  shellcheck

        (use-package flymake-shellcheck
          :disabled t
          :commands flymake-shellcheck-load
          :init
          (defun rgr/sh-mode-hook()
            (flymake-shellcheck-load)
            (flymake-mode +1))
          :hook (sh-mode . rgr/sh-mode-hook))
    
    1.  external info files
    
            (require 'info)
            (add-to-list 'Info-directory-list (expand-file-name  "var/info" user-emacs-directory))

2.  elisp checks

        (defun rgr/elisp-edit-mode()
          "return non nil if this buffer edits elisp"
          (member major-mode '(emacs-lisp-mode lisp-interaction-mode)))

3.  linting

    [package-lint](https://github.com/purcell/package-lint) provides a linter for the metadata in Emacs Lisp files which are intended to be packages. You can integrate it into your build process.
    
        (use-package package-lint)

4.  elisp popup context help

    Display a poup containing docstring at point
    
        (setq load-path (cons (expand-file-name "el-docstring-sap" rgr/emacs-project-dir ) load-path))
        (use-package el-docstring-sap
          :after (eldoc posframe)
          :ensure nil
          :hook
          (emacs-lisp-mode . el-docstring-sap-mode)
          :bind
          ("M-<f2>" . el-docstring-sap-display)
          ("M-<f1>" . el-docstring-sap-mode))

5.  Elisp debugging

    1.  edebug
    
            (use-package edebug-x
              :custom
              (debugger-stack-frame-as-list t)
              ;;(edebug-trace nil)
              :config
              (defun rgr/instrumentForDebugging() "use the universal prefix arg (C-u) to remove instrumentation"
                     (interactive)
                     (if current-prefix-arg (eval-defun nil)
                       (eval-defun 0)))
              :bind
              ("C-S-<f9>" . toggle-debug-on-error)
              ("C-<f9>" . rgr/instrumentForDebugging))
