emacs-config.org
***** display value at point in edebug
#+begin_src  emacs-lisp

  ;; bit more convoluted than it needs to be
  ;; but I fancied using thing-at-point
  (defun rgr/edebug-display-thing-at-point()
    (let ((tap (thing-at-point 'var)))
      (if tap
          (message "%s: %s" (nth 0 tap) (nth 1 tap)))))

  (defun rgr/edebug-thing-at-point()
    "message display the vale of the symbol at point"
    (let((tap (thing-at-point 'symbol)))
      (if tap
          (let((sym (if (symbolp tap) tap (intern-soft tap))))
            (condition-case nil
                (list sym (edebug-eval  sym))
              (error nil))))))

  (defun rgr/edebug-mode-hook()
    (setq-local thing-at-point-provider-alist
                (append thing-at-point-provider-alist
                        '((var . rgr/edebug-thing-at-point))))
    "add a call to display the value at point when debugging with edebug"
    (add-hook 'post-command-hook #'rgr/edebug-display-thing-at-point nil :local))

  (add-hook 'edebug-mode-hook  #'rgr/edebug-mode-hook)
#+end_src

#+RESULTS:
| myELisp | edebug-x-mode |
**** Formatting
:PROPERTIES:
:ID:       d360a0c5-e21a-445b-a9ae-d97d33dce966
:END:
#+begin_src emacs-lisp
  (use-package
    elisp-format
    :bind
    (:map emacs-lisp-mode-map
          ("C-c f" . elisp-format-region)))
#+end_src
**** popup query symbol
:PROPERTIES:
:ID:       4745e152-bad7-4a31-8f9b-79cb62cdb430
:END:
#+begin_src emacs-lisp
  (use-package popup
    :config
    (defun rgr/show-symbol-details ()
      (interactive)
      (popup-tip (format "intern-soft thing-at-point: %s, symbolp: %s, symbol-name:%s"
                         (setq-local sym (intern-soft (thing-at-point 'symbol)))
                         (symbolp sym)
                         (symbol-name sym))))
    :bind
    (:map emacs-lisp-mode-map (("M-6" . #'rgr/show-symbol-details))))
#+end_src

** General configuration
*** general ui
#+begin_src  emacs-lisp
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (menu-bar-mode -1)

  (winner-mode 1)

  (repeat-mode)

  (global-auto-revert-mode 1)
  ;; Also auto refresh dired, but be quiet about it
  (setq global-auto-revert-non-file-buffers t)
  (setq auto-revert-verbose nil)
  (setq auto-revert-use-notify nil)

  ;; Window layout
  ;;(add-to-list 'display-buffer-alist  `((or ,(rx (or "*eww*" "*info*" "*helpful*" "*help*"))) (display-buffer-in-side-window) (window-sides-vertical . t)(side . right)(slot . -1) (window-width . 0.5)) )
  ;; popper

  (require 'windmove)
  (windmove-default-keybindings)

  (global-visual-line-mode 1)

  (setq column-number-mode t)

  (delete-selection-mode 1)

  ;; (setq frame-title-format (if (member "-chat" command-line-args)  "Chat: %b" '("%b@" (:eval (or (file-remote-p default-directory 'host) system-name)) "  Emacs")))

  (defalias 'yes-or-no-p 'y-or-n-p)

  (setq disabled-command-function nil)

  (global-hl-line-mode t)

  (use-package delsel
    :ensure nil
    :hook (after-init . delete-selection-mode))

  (defun prot/keyboard-quit-dwim ()
    "Do-What-I-Mean behaviour for a general `keyboard-quit'.

  The generic `keyboard-quit' does not do the expected thing when
  the minibuffer is open.  Whereas we want it to close the
  minibuffer, even without explicitly focusing it.

  The DWIM behaviour of this command is as follows:

  - When the region is active, disable it.
  - When a minibuffer is open, but not focused, close the minibuffer.
  - When the Completions buffer is selected, close it.
  - In every other case use the regular `keyboard-quit'."
    (interactive)
    (cond
     ((region-active-p)
      (keyboard-quit))
     ((derived-mode-p 'completion-list-mode)
      (delete-completion-window))
     ((> (minibuffer-depth) 0)
      (abort-recursive-edit))
     (t
      (keyboard-quit))))

  (define-key global-map (kbd "C-g") #'prot/keyboard-quit-dwim)

  ;; display dir name when core name clashes
  (require 'uniquify)

  (defun rgr/kill-current-buffer()
    (interactive)
    (if (member (buffer-name) '("*Messages*" "*scratch*"))
        (progn
          (message "Can't delete %s. Are you mad? Closing window instead." (buffer-name))
          (delete-window))
      (kill-current-buffer)
      (delete-window)))

  (bind-keys
   ("C-x C-q" . view-mode)
   ( "C-x C-b" . ibuffer)
   ( "C-x C-i" . imenu)
   ( "C-x k" . rgr/kill-current-buffer)
   ( "M-0" . delete-window)
   ( "M-1" . delete-other-windows)
   ( "S-<f1>" . describe-face)
   (  "M-m"  . manual-entry)
   ( "S-<f10>" . menu-bar-open))

#+end_src
*** taming windows
#+begin_src  emacs-lisp
  (use-package popper
    :ensure t
    :custom
    (popper-window-height 'rgr/popper-window-height)
    :config
    (defun rgr/popper-window-height(win)
      (interactive)
      (/ (frame-height) 3))
    :init
    (popper-mode +1)
    (popper-echo-mode +1)
    :bind (("C-"   . popper-toggle)
           ("M-"   . popper-cycle)
           ("C-M-" . popper-toggle-type)))
#+end_src 
*** posframe                                                       :posframe:
:PROPERTIES:
:ID:       0f03bab9-b745-451a-a8ad-ab7703977c61
:END:
[[https://github.com/tumashu/posframe][Posframe]]
can pop up a frame at point, this posframe is a child-frame connected to its root window's buffer.
#+begin_src emacs-lisp
    (use-package posframe
      :demand t)
#+end_src
*** ACE utilities
:PROPERTIES:
:ID:       024175d8-f05e-4c41-9c04-4a61d55a5d66
:END:
**** [[https://github.com/abo-abo/ace-window][Ace-Window]] provides better window switching.
#+begin_src emacs-lisp
  (use-package ace-window
    :bind
    ("M-o" . ace-window)
    ("M-d" . ace-delete-window))
#+end_src
**** hopping around links
:PROPERTIES:
:ID:       6a50d585-4163-4b7e-9dd8-b25fd0ee4e6b
:END:
Quickly follow [[https://github.com/abo-abo/ace-link][links]] in Emacs.
#+begin_src emacs-lisp
  (use-package ace-link
    :demand
    :config
    (ace-link-setup-default))
#+end_src
*** pulsar                                                           :pulsar:
visual feedback as to cursor position
https://protesilaos.com/emacs/pulsar
#+begin_src emacs-lisp
  (use-package pulsar
    :custom
    (pulsar-pulse t)
    (pulsar-delay 0.2)
    (pulsar-iterations 15)
    (pulsar-face 'isearch)
    (pulsar-highlight-face 'pulsar-green)
    :init
    (add-hook 'minibuffer-setup-hook #'pulsar-pulse-line)
    (add-hook 'consult-after-jump-hook #'pulsar-recenter-middle)
    (add-hook 'consult-after-jump-hook #'pulsar-reveal-entry)
    :config
    (
     pulsar-global-mode 1))

#+end_src
*** boxquote                                                       :boxquote:
#+begin_src emacs-lisp
  (use-package boxquote
    ;;:straight (:branch "main")
    :bind
    ("C-S-r" . boxquote-region))

#+end_src
*** volatile-highlights                         :volatilehighlights:volatile:
brings visual feedback to some operations by highlighting portions relating to the operations.
#+begin_src emacs-lisp
  (use-package
    volatile-highlights
    :init (volatile-highlights-mode 1))
#+end_src
*** web pasting
#+begin_src emacs-lisp
  (use-package
    dpaste
    :init
    :bind ("C-c y" . dpaste-region-or-buffer))

#+end_src
*** reading / concentration aids
**** Darkroom
:PROPERTIES:
:END:
Zoom in and center using [[https://github.com/joaotavora/darkroom][darkroom]].
#+begin_src emacs-lisp
  (use-package
    darkroom
    :bind
    ( "<C-f7>" . 'darkroom-mode))
#+end_src
**** Olivetti Mode
#+begin_src  emacs-lisp
  (use-package olivetti
    :disabled t
    :bind 
    ("C-S-<f7>" . olivetti-mode))
#+end_src
**** WriteRoomMode
#+begin_src  emacs-lisp
  (use-package writeroom-mode
    :bind 
    ("C-S-<f7>" . writeroom-mode))
#+end_src 
*** Ansi colour
:PROPERTIES:
:END:
[[https://www.emacswiki.org/emacs/AnsiColor][Ansi colour hooks]] to enable emacs buffers to handle ansi.
#+begin_src emacs-lisp :tangle no
  (require 'ansi-color)
  (add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
  (add-to-list 'comint-output-filter-functions 'ansi-color-process-output)
#+end_src
