README.md


### Tabs

    
    (defun consult-buffer-other-tab ()
      "Variant of `consult-buffer' which opens in other tab."
      (interactive)
      (let ((consult--buffer-display #'switch-to-buffer-other-tab))
        (consult-buffer)))

1.  emacs-modern-tab-bar

        (use-package modern-tab-bar
        :ensure (:host github :repo "aaronjensen/emacs-modern-tab-bar")
        :custom
        (tab-bar-show t)
        (tab-bar-new-button nil)
        (tab-bar-close-button-show nil)
        (tab-bar-select-tab-modifiers '(control))
        :init
        (modern-tab-bar-mode))


### buffer utlities

    (defun get-buffers-with-minor-mode (minor-mode)
      "Get a list of buffers in which minor-mode is active"
      (interactive)
      (let ((minor-mode-buffers))
        (dolist (buf (buffer-list) minor-mode-buffers)
          (with-current-buffer buf
            (when (memq minor-mode (manage-minor-mode--active-list))
              (push buf minor-mode-buffers))))))
    
    
    (defun get-buffers-with-major-mode (m-mode)
      "Get a list of buffers in which minor-mode is active"
      (interactive)
      (let ((major-mode-buffers)) 
        (dolist (buf (buffer-list) major-mode-buffers)
          (with-current-buffer buf
            (when (string= major-mode m-mode)
              (push buf major-mode-buffers))))))   ;; (nth 0 (get-buffers-with-major-mode "dired-mod"))
    
    ;; Taken from https://github.com/ShingoFukuyama/manage-minor-mode
    (defun manage-minor-mode--active-list ()
      "Get a list of which minor modes are enabled in the current buffer."
      (let ($list)
        (mapc (lambda ($mode)
                (condition-case nil
                    (if (and (symbolp $mode) (symbol-value $mode))
                        (setq $list (cons $mode $list)))
                  (error nil)))
              minor-mode-list)
        (sort $list 'string<)))


### switch to dired buffer else open it

    (defvar rgr/last-dired nil "last dired buffer opened")
    (add-hook 'dired-after-readin-hook (lambda()(setq rgr/last-dired (buffer-name))))
    (defun switch-to-dired(&optional d)
      (if (and rgr/last-dired (get-buffer rgr/last-dired))
          (switch-to-buffer rgr/last-dired)
        (let ((db (nth 0 (last (get-buffers-with-major-mode "dired-mode")))))
          (if db (switch-to-buffer db)
            (dired (if d d "~"))))))


### multiple-cursors

<https://github.com/magnars/multiple-cursors.el>

    (use-package multiple-cursors
      :bind
      ("C-<mouse-1>" . add-cursor-on-click)
      ("C-S-n" . mc/mark-next-like-this)
      ("C-S-p" . mc/mark-previous-like-this)
      ("C-S-w" . mc/mark-all-dwim)
      ("C-S-a" . mc/mark-all-like-this)
      ("C-S-SPC" . mc/edit-lines)
      )


### jinx : the enchanted spell checker

    (use-package jinx
      :hook (emacs-startup . global-jinx-mode)
      :bind
      ("M-$" . jinx-correct)
      ("<f8>" . jinx-correct)
      ("S-<f8>" . jinx-correct-word)
      ("C-<f8>" . jinx-languages))

\#+end\_src 


## Late load-dir

    (add-hook 'elpaca-after-init-hook (lambda()(load-el-gpg (expand-file-name "etc/late-load" user-emacs-directory))))


# DIRED Daemon Init File

This tangles to its own init file [init-dired.el](etc/elisp/init-dired.el).

    (add-hook 'elpaca-after-init-hook (lambda()(run-with-idle-timer 1 nil  (lambda()(dired "~")))))
    (add-hook 'server-after-make-frame-hook (lambda(&optional f)(run-with-idle-timer 1 nil  (lambda()(switch-to-buffer (other-buffer))))))
