emacs-config.org
* IRC daemon init file
:PROPERTIES:
:header-args:emacs-lisp: :tangle (rgr/user-elisp-file "init-irc.el")
:END:
This tangles to its own init file [[file:etc/elisp/init-irc.el][init-irc.el]] and locks down emacs a little. This is so I can run an erc "session" without interfering with other emacsy things.

** erc
#+begin_src  emacs-lisp 
  ;; generally loaded from init-erc.el ins a kiosk like mode
  (require 'erc)

  (add-hook 'find-file-hook (lambda()(read-only-mode 1)))
  (set-face-background 'mode-line "orangered")
  (defun my/erc-buffer-connected-p (buffer)
    "Check if ERC BUFFER is connected."
    (with-current-buffer buffer
      (and (erc-server-process-alive)
           erc-server-connected)))

  ;;https://emacs.stackexchange.com/questions/64361/how-to-check-if-erc-is-running
  (defun my/erc-start-or-switch (&optional rest)
    (interactive)
    (let ((erc-buffers '("Libera.Chat" "irc.libera.chat" "irc.libera.chat:6667"))
          (connected nil))
      (dolist (buffer erc-buffers)
        (when (and (get-buffer buffer)
                   (my/erc-buffer-connected-p buffer))
          (setq connected t)))
      (if connected
          (rgr/erc-switch-to-channel)
        (progn
          (emacs-alert "Connecting to IRC")
          (erc :server "irc.libera.chat" :port 6667)
          (global-set-key (kbd "C-c C-q") 'rgr/irc-quit )))))

  (defun rgr/erc-switch-to-channel(&optional frame channel)
    (let ((c (or channel "#emacs")))
      (if (get-buffer c)
          (switch-to-buffer c))))

  (defun rgr/irc-quit()
    (interactive)
    (erc-quit-server "leaving emacs session")
    (when (functionp 'ement-disconnect)
      (let ((current-prefix-arg '(4)))
        (call-interactively 'ement-disconnect))))

  (setq kill-emacs-hook '(rgr/irc-quit))


#+end_src

** matrix client ement
#+begin_src  emacs-lisp
  (use-package ement
    :disabled t
    :demand t
    :bind ("M-g M-l" . 'ement-room-list))
#+end_src

** starting irc/chats
#+begin_src  emacs-lisp
  (defun rgr/irc-reconnect(&optional f)
    (interactive)
    (my/erc-start-or-switch)
    (if (featurep 'ement)
        (if ement-sessions
        (ement-room-list)
      (call-interactively 'ement-connect))))

  (add-hook 'server-after-make-frame-hook #'rgr/irc-reconnect)
  ;;  (add-hook 'elpaca-after-init-hook (lambda()(run-with-idle-timer 1 nil #'rgr/irc-reconnect)))

#+end_src 


* Associated emacs things
:PROPERTIES:
:ID:       c77645d3-d03f-47ab-a30f-fc649c70ef31
:END:
** building emacs
*** configure
#+begin_src bash :tangle "~/.emacs.d/bin/emacs-configure"
  #!/usr/bin/env bash
  # Maintained in emacs-config.org
  cd ~/development/emacs/emacs/
  ./configure --with-x-toolkit=lucid -with-tree-sitter --with-native-compilation --prefix="/usr/local/" 
#+end_src

*** make
#+begin_src bash :tangle "~/.emacs.d/bin/emacs-make"
  #!/usr/bin/env bash
  # Maintained in emacs-config.org
  cd ~/development/emacs/emacs/
  make -j$(nproc) && sudo make install
#+end_src


** Project version control with  git

*** .gitignore
An exclusionary .gitignore. You need to specfically add in things you wish
to add to version control.

#+include: "./.gitignore" src config


** Setting up emacs as a default editor using a dot desktop file and associated protocol handler
:PROPERTIES:
:ID:       ac99a443-46fe-4878-a311-db5bce8568e5
:END:
*** [[file:editor-config/php.ini][php.ini]] changes e.g /etc/php/7.3/php.ini
:PROPERTIES:
:ID:       32d189b9-f59e-49ef-bfde-d0184ff833f1
:END:
~xdebug.file_link_format~ is used by compliant apps to format a protocol uri. This is handled on my Linux system as a result of [[id:b8c2fbcf-9487-4220-b5fe-2d7d352655dd][emacsclient.desktop]] documented below.
#+begin_src conf :tangle editor-config/php.ini"
  xdebug.file_link_format = "emacsclient://%f@%l"

  xdebug.remote_enable = 1
  xdebug.remote_host = localhost
  xdebug.remote_port = 9000
#+end_src
#+include: "./editor-config/php.ini" src eshell
*** [[file:bin/emacsclient-linenumber][emacsclient-linenumber]] script to correctly parse the protocol in order to start emacs frame at correct line
:PROPERTIES:
:ID:       6e22d271-57bb-47a0-853e-acbc91f1cbd4
:END:
#+begin_src bash :tangle bin/emacsclient-linenumber
  #!/usr/bin/env bash
  # Maintained in emacs-config.org
  export GDK_NATIVE_WINDOWS=1
  file=`echo "$@" | sed 's/.*://;s/@.*$//'`
  line=`echo "$@" | sed 's/.*@//'`
  echo $file
  echo $line

  re='^[0-9]+$'
  if ! [[ $line =~ $re ]] ; then
      exec emacsclient -c -a ""  $file
  else
      exec emacsclient -c -a "" +$line  $file
  fi
#+end_src
*** Gnome protocol handler desktop file
:PROPERTIES:
:ID:       b8c2fbcf-9487-4220-b5fe-2d7d352655dd
:END:
Copy [[file+sys:editor-config/emacsclient.desktop][emacsclient.desktop]] to  ~/.local/share/applications (Debian & Gnome - your mileage may vary...)

#+begin_src conf :tangle "./editor-config/emacsclient.desktop"
  [Desktop Entry]
  Name=Emacs (Client)
  GenericName=Text Editor
  Comment=Edit text
  MimeType=text/english;text/plain;text/x-makefile;text/x-c++hdr;text/x-c++src;text/x-chdr;text/x-csrc;text/x-java;text/x-moc;text/x-pascal;text/x-tcl;text/x-tex;application/x-shellscript;text/x-c;text/x-c++;
  Exec=emacsclient -c -a "" %F
  Icon=emacs
  Type=Application
  Terminal=false
  Categories=Development;TextEditor;Utility;
  StartupWMClass=Emacs
#+end_src

Update the desktop database:

#+begin_src bash
  update-desktop-database ~/.local/share/applications
#+end_src

now allows emacsclient to be called.

note: symlink the deprecated [[https://wiki.archlinux.org/index.php/XDG_MIME_Applications][~/.local/share/applications/mimeapps.lst]] to the one in ~/.config

#+begin_src bash
  ln -sf  ~/config/mimeapps.lst ~/.local/share/applications/
#+end_src
*** Always using emacsclient
:PROPERTIES:
:ID:       a2dda54e-6a70-4bbd-96ec-7dd38e49dbc0
:END:
Set up a zshrc alias so that "emacs" actually invokes emacs client. In my .zshrc:
#+begin_src shell
  alias emacs='emacsclient --create-frame --alternate-editor=""'
#+end_src
** [[file:bin/emacs-same-frame][bin/emacs-same-frame]] open emacs in the same frame
:PROPERTIES:
:ID:       b85efbb3-22c8-46cb-937c-d398165750ad
:END:
#+begin_src bash :tangle bin/emacs-same-frame
  #!/bin/bash
  if ! pidof "emacs"; then
      emacsclient -n -c -a "" "$@"
  else
      emacsclient -e "(if (> (length (frame-list)) 1) 't)" | grep -q t
      if [ "$?" = 1 ]; then
          emacsclient -n -c -a "" "$@"
      else
          emacsclient -n -a "" "$@"
          pop-window "Emacs"
      fi
  fi
#+end_src

# Local Variables:
# jinx-languages: "en"
# End:
