README.md


# IRC daemon init file

This tangles to its own init file [init-irc.el](etc/elisp/init-irc.el) and locks down emacs a little. This is so I can run an erc "session" without interfering with other emacsy things.


## erc

    ;; generally loaded from init-erc.el ins a kiosk like mode
    (require 'erc)
    
    (add-hook 'find-file-hook (lambda()(read-only-mode 1)))
    (set-face-background 'mode-line "orangered")
    (defun my/erc-buffer-connected-p (buffer)
      "Check if ERC BUFFER is connected."
      (with-current-buffer buffer
        (and (erc-server-process-alive)
             erc-server-connected)))
    
    ;;https://emacs.stackexchange.com/questions/64361/how-to-check-if-erc-is-running
    (defun my/erc-start-or-switch (&optional rest)
      (interactive)
      (let ((erc-buffers '("Libera.Chat" "irc.libera.chat" "irc.libera.chat:6667"))
            (connected nil))
        (dolist (buffer erc-buffers)
          (when (and (get-buffer buffer)
                     (my/erc-buffer-connected-p buffer))
            (setq connected t)))
        (if connected
            (rgr/erc-switch-to-channel)
          (progn
            (emacs-alert "Connecting to IRC")
            (erc :server "irc.libera.chat" :port 6667)
            (global-set-key (kbd "C-c C-q") 'rgr/irc-quit )))))
    
    (defun rgr/erc-switch-to-channel(&optional frame channel)
      (let ((c (or channel "#emacs")))
        (if (get-buffer c)
            (switch-to-buffer c))))
    
    (defun rgr/irc-quit()
      (interactive)
      (erc-quit-server "leaving emacs session")
      (when (functionp 'ement-disconnect)
        (let ((current-prefix-arg '(4)))
          (call-interactively 'ement-disconnect))))
    
    (setq kill-emacs-hook '(rgr/irc-quit))


## matrix client ement

    (use-package ement
      :disabled t
      :demand t
      :bind ("M-g M-l" . 'ement-room-list))


## starting irc/chats

    (defun rgr/irc-reconnect(&optional f)
      (interactive)
      (my/erc-start-or-switch)
      (if (featurep 'ement)
          (if ement-sessions
          (ement-room-list)
        (call-interactively 'ement-connect))))
    
    (add-hook 'server-after-make-frame-hook #'rgr/irc-reconnect)
    ;;  (add-hook 'elpaca-after-init-hook (lambda()(run-with-idle-timer 1 nil #'rgr/irc-reconnect)))


# Associated emacs things


## building emacs


### configure

    #!/usr/bin/env bash
    # Maintained in emacs-config.org
    cd ~/development/emacs/emacs/
    ./configure --with-x-toolkit=lucid -with-tree-sitter --with-native-compilation --prefix="/usr/local/" 


### make

    #!/usr/bin/env bash
    # Maintained in emacs-config.org
    cd ~/development/emacs/emacs/
    make -j$(nproc) && sudo make install


## Project version control with  git


### .gitignore

An exclusionary .gitignore. You need to specfically add in things you wish
to add to version control.

    *
    *.*
    
    !.gitignore
    !.gitattributes
    !.ignore
    
    !emacs-config.org
    !early-init.el
    !init.el
    !README.md
    !custom.el
    
    !elpaca-versions.lock
    
    !info
    !info/*
    
    !etc
    !var
    !var/secrets
    !var/secrets/bmkp
    !var/secrets/bmkp/*
    !var/secrets/ement-sessions.el
    
    
    !etc/abbrev
    !etc/abbrev/*
    
    !etc/early-load
    !etc/early-load/*
    
    !etc/elfeed
    !etc/elfeed/elfeed.org
    
    
    !etc/org
    !etc/org/agenda-files.txt
    !etc/org/template.org
    
    !etc/eshell
    !etc/eshell/alias
    
    !etc/elisp
    !etc/elisp/*.el
    !etc/elisp/README
    
    
    !etc/hosts
    !etc/hosts/thinkpadx270
    !etc/hosts/thinkpadx270/custom.el
    !etc/hosts/thinkpadx60
    !etc/hosts/thinkpadx60/custom.el
    !etc/hosts/intelnuc
    !etc/hosts/intelnuc/custom.el
    !etc/hosts/xmgneo
    !etc/hosts/x13amdg4
    !etc/hosts/x13amdg4/faces.el
    !etc/hosts/xmgneo/custom.el
    
    !editor-config
    !editor-config/*
    
    !bin
    !bin/*
    
    !images
    !images/*
    
    !straight
    !straight/versions
    !straight/versions/*


## Setting up emacs as a default editor using a dot desktop file and associated protocol handler


### [php.ini](editor-config/php.ini) changes e.g /etc/php/7.3/php.ini

`xdebug.file_link_format` is used by compliant apps to format a protocol uri. This is handled on my Linux system as a result of [emacsclient.desktop](#orgcff91a6) documented below.

    xdebug.file_link_format = "emacsclient://%f@%l"
    
    xdebug.remote_enable = 1
    xdebug.remote_host = localhost
    xdebug.remote_port = 9000

    xdebug.file_link_format = "emacsclient://%f@%l"
    
    xdebug.remote_enable = 1
    xdebug.remote_host = localhost
    xdebug.remote_port = 9000


### [emacsclient-linenumber](bin/emacsclient-linenumber) script to correctly parse the protocol in order to start emacs frame at correct line

    #!/usr/bin/env bash
    # Maintained in emacs-config.org
    export GDK_NATIVE_WINDOWS=1
    file=`echo "$@" | sed 's/.*://;s/@.*$//'`
    line=`echo "$@" | sed 's/.*@//'`
    echo $file
    echo $line
    
    re='^[0-9]+$'
    if ! [[ $line =~ $re ]] ; then
        exec emacsclient -c -a ""  $file
    else
        exec emacsclient -c -a "" +$line  $file
    fi


<a id="orgcff91a6"></a>

### Gnome protocol handler desktop file

Copy [emacsclient.desktop](editor-config/emacsclient.desktop) to  ~/.local/share/applications (Debian & Gnome - your mileage may vary&#x2026;)

    [Desktop Entry]
    Name=Emacs (Client)
    GenericName=Text Editor
    Comment=Edit text
    MimeType=text/english;text/plain;text/x-makefile;text/x-c++hdr;text/x-c++src;text/x-chdr;text/x-csrc;text/x-java;text/x-moc;text/x-pascal;text/x-tcl;text/x-tex;application/x-shellscript;text/x-c;text/x-c++;
    Exec=emacsclient -c -a "" %F
    Icon=emacs
    Type=Application
    Terminal=false
    Categories=Development;TextEditor;Utility;
    StartupWMClass=Emacs

Update the desktop database:

    update-desktop-database ~/.local/share/applications

now allows emacsclient to be called.

note: symlink the deprecated [~/.local/share/applications/mimeapps.lst](https://wiki.archlinux.org/index.php/XDG_MIME_Applications) to the one in ~/.config

    ln -sf  ~/config/mimeapps.lst ~/.local/share/applications/


### Always using emacsclient

Set up a zshrc alias so that "emacs" actually invokes emacs client. In my .zshrc:

    alias emacs='emacsclient --create-frame --alternate-editor=""'


## [bin/emacs-same-frame](bin/emacs-same-frame) open emacs in the same frame

    #!/bin/bash
    if ! pidof "emacs"; then
        emacsclient -n -c -a "" "$@"
    else
        emacsclient -e "(if (> (length (frame-list)) 1) 't)" | grep -q t
        if [ "$?" = 1 ]; then
            emacsclient -n -c -a "" "$@"
        else
            emacsclient -n -a "" "$@"
            pop-window "Emacs"
        fi
    fi

